Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1643 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x24098): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x78bd9): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x325cd): D:/Users/kunal/Documents/STMcubeide1.8.0/GB_STM32_HLW8012_HAL/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x4455b): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x27dea): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

    <4b>   DW_AT_name        : (indirect string, offset: 0x6f2a7): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0x2cd0b): short unsigned int
 <1><5d>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e>   DW_AT_name        : (indirect string, offset: 0x53c41): __int32_t
    <62>   DW_AT_decl_file   : 3
    <63>   DW_AT_decl_line   : 77
    <64>   DW_AT_decl_column : 24
    <65>   DW_AT_type        : <0x69>
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 5	(signed)
    <6c>   DW_AT_name        : (indirect string, offset: 0xbcdc): long int
 <1><70>: Abbrev Number: 3 (DW_TAG_typedef)
    <71>   DW_AT_name        : (indirect string, offset: 0x56893): __uint32_t
    <75>   DW_AT_decl_file   : 3
    <76>   DW_AT_decl_line   : 79
    <77>   DW_AT_decl_column : 25
    <78>   DW_AT_type        : <0x7c>
 <1><7c>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d>   DW_AT_byte_size   : 4
    <7e>   DW_AT_encoding    : 7	(unsigned)
    <7f>   DW_AT_name        : (indirect string, offset: 0x20118): long unsigned int
 <1><83>: Abbrev Number: 2 (DW_TAG_base_type)
    <84>   DW_AT_byte_size   : 8
    <85>   DW_AT_encoding    : 5	(signed)
    <86>   DW_AT_name        : (indirect string, offset: 0x3ea2a): long long int
 <1><8a>: Abbrev Number: 2 (DW_TAG_base_type)
    <8b>   DW_AT_byte_size   : 8
    <8c>   DW_AT_encoding    : 7	(unsigned)
    <8d>   DW_AT_name        : (indirect string, offset: 0x1c1de): long long unsigned int
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 4
    <93>   DW_AT_encoding    : 5	(signed)
    <94>   DW_AT_name        : int
 <1><98>: Abbrev Number: 2 (DW_TAG_base_type)
    <99>   DW_AT_byte_size   : 4
    <9a>   DW_AT_encoding    : 7	(unsigned)
    <9b>   DW_AT_name        : (indirect string, offset: 0xb6ac): unsigned int
 <1><9f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a0>   DW_AT_name        : (indirect string, offset: 0x27dec): uint8_t
    <a4>   DW_AT_decl_file   : 4
    <a5>   DW_AT_decl_line   : 24
    <a6>   DW_AT_decl_column : 19
    <a7>   DW_AT_type        : <0x30>
 <1><ab>: Abbrev Number: 5 (DW_TAG_const_type)
    <ac>   DW_AT_type        : <0x9f>
 <1><b0>: Abbrev Number: 3 (DW_TAG_typedef)
    <b1>   DW_AT_name        : (indirect string, offset: 0x6f2a9): uint16_t
    <b5>   DW_AT_decl_file   : 4
    <b6>   DW_AT_decl_line   : 36
    <b7>   DW_AT_decl_column : 20
    <b8>   DW_AT_type        : <0x4a>
 <1><bc>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <bd>   DW_AT_type        : <0xb0>
 <1><c1>: Abbrev Number: 3 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x53c43): int32_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 44
    <c8>   DW_AT_decl_column : 19
    <c9>   DW_AT_type        : <0x5d>
 <1><cd>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <ce>   DW_AT_type        : <0xc1>
 <1><d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d3>   DW_AT_name        : (indirect string, offset: 0x56895): uint32_t
    <d7>   DW_AT_decl_file   : 4
    <d8>   DW_AT_decl_line   : 48
    <d9>   DW_AT_decl_column : 20
    <da>   DW_AT_type        : <0x70>
 <1><de>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <df>   DW_AT_type        : <0xd2>
 <1><e3>: Abbrev Number: 7 (DW_TAG_variable)
    <e4>   DW_AT_name        : (indirect string, offset: 0x30b3): ITM_RxBuffer
    <e8>   DW_AT_decl_file   : 5
    <e9>   DW_AT_decl_line   : 1864
    <eb>   DW_AT_decl_column : 25
    <ec>   DW_AT_type        : <0xcd>
    <f0>   DW_AT_external    : 1
    <f0>   DW_AT_declaration : 1
 <1><f0>: Abbrev Number: 8 (DW_TAG_variable)
    <f1>   DW_AT_name        : (indirect string, offset: 0x666ab): SystemCoreClock
    <f5>   DW_AT_decl_file   : 6
    <f6>   DW_AT_decl_line   : 51
    <f7>   DW_AT_decl_column : 17
    <f8>   DW_AT_type        : <0xd2>
    <fc>   DW_AT_external    : 1
    <fc>   DW_AT_declaration : 1
 <1><fc>: Abbrev Number: 9 (DW_TAG_array_type)
    <fd>   DW_AT_type        : <0xab>
    <101>   DW_AT_sibling     : <0x10c>
 <2><105>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <106>   DW_AT_type        : <0x98>
    <10a>   DW_AT_upper_bound : 15
 <2><10b>: Abbrev Number: 0
 <1><10c>: Abbrev Number: 5 (DW_TAG_const_type)
    <10d>   DW_AT_type        : <0xfc>
 <1><111>: Abbrev Number: 8 (DW_TAG_variable)
    <112>   DW_AT_name        : (indirect string, offset: 0x7aea1): AHBPrescTable
    <116>   DW_AT_decl_file   : 6
    <117>   DW_AT_decl_line   : 52
    <118>   DW_AT_decl_column : 23
    <119>   DW_AT_type        : <0x10c>
    <11d>   DW_AT_external    : 1
    <11d>   DW_AT_declaration : 1
 <1><11d>: Abbrev Number: 9 (DW_TAG_array_type)
    <11e>   DW_AT_type        : <0xab>
    <122>   DW_AT_sibling     : <0x12d>
 <2><126>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <127>   DW_AT_type        : <0x98>
    <12b>   DW_AT_upper_bound : 7
 <2><12c>: Abbrev Number: 0
 <1><12d>: Abbrev Number: 5 (DW_TAG_const_type)
    <12e>   DW_AT_type        : <0x11d>
 <1><132>: Abbrev Number: 8 (DW_TAG_variable)
    <133>   DW_AT_name        : (indirect string, offset: 0x572c3): APBPrescTable
    <137>   DW_AT_decl_file   : 6
    <138>   DW_AT_decl_line   : 53
    <139>   DW_AT_decl_column : 23
    <13a>   DW_AT_type        : <0x12d>
    <13e>   DW_AT_external    : 1
    <13e>   DW_AT_declaration : 1
 <1><13e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <13f>   DW_AT_byte_size   : 16
    <140>   DW_AT_decl_file   : 7
    <141>   DW_AT_decl_line   : 291
    <143>   DW_AT_decl_column : 9
    <144>   DW_AT_sibling     : <0x181>
 <2><148>: Abbrev Number: 12 (DW_TAG_member)
    <149>   DW_AT_name        : CCR
    <14d>   DW_AT_decl_file   : 7
    <14e>   DW_AT_decl_line   : 293
    <150>   DW_AT_decl_column : 17
    <151>   DW_AT_type        : <0xde>
    <155>   DW_AT_data_member_location: 0
 <2><156>: Abbrev Number: 13 (DW_TAG_member)
    <157>   DW_AT_name        : (indirect string, offset: 0x34c9e): CNDTR
    <15b>   DW_AT_decl_file   : 7
    <15c>   DW_AT_decl_line   : 294
    <15e>   DW_AT_decl_column : 17
    <15f>   DW_AT_type        : <0xde>
    <163>   DW_AT_data_member_location: 4
 <2><164>: Abbrev Number: 13 (DW_TAG_member)
    <165>   DW_AT_name        : (indirect string, offset: 0x8251e): CPAR
    <169>   DW_AT_decl_file   : 7
    <16a>   DW_AT_decl_line   : 295
    <16c>   DW_AT_decl_column : 17
    <16d>   DW_AT_type        : <0xde>
    <171>   DW_AT_data_member_location: 8
 <2><172>: Abbrev Number: 13 (DW_TAG_member)
    <173>   DW_AT_name        : (indirect string, offset: 0x4b45d): CMAR
    <177>   DW_AT_decl_file   : 7
    <178>   DW_AT_decl_line   : 296
    <17a>   DW_AT_decl_column : 17
    <17b>   DW_AT_type        : <0xde>
    <17f>   DW_AT_data_member_location: 12
 <2><180>: Abbrev Number: 0
 <1><181>: Abbrev Number: 14 (DW_TAG_typedef)
    <182>   DW_AT_name        : (indirect string, offset: 0x6ead0): DMA_Channel_TypeDef
    <186>   DW_AT_decl_file   : 7
    <187>   DW_AT_decl_line   : 297
    <189>   DW_AT_decl_column : 3
    <18a>   DW_AT_type        : <0x13e>
 <1><18e>: Abbrev Number: 11 (DW_TAG_structure_type)
    <18f>   DW_AT_byte_size   : 8
    <190>   DW_AT_decl_file   : 7
    <191>   DW_AT_decl_line   : 299
    <193>   DW_AT_decl_column : 9
    <194>   DW_AT_sibling     : <0x1b5>
 <2><198>: Abbrev Number: 12 (DW_TAG_member)
    <199>   DW_AT_name        : ISR
    <19d>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 301
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xde>
    <1a5>   DW_AT_data_member_location: 0
 <2><1a6>: Abbrev Number: 13 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x5f758): IFCR
    <1ab>   DW_AT_decl_file   : 7
    <1ac>   DW_AT_decl_line   : 302
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xde>
    <1b3>   DW_AT_data_member_location: 4
 <2><1b4>: Abbrev Number: 0
 <1><1b5>: Abbrev Number: 14 (DW_TAG_typedef)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x31aa9): DMA_TypeDef
    <1ba>   DW_AT_decl_file   : 7
    <1bb>   DW_AT_decl_line   : 303
    <1bd>   DW_AT_decl_column : 3
    <1be>   DW_AT_type        : <0x18e>
 <1><1c2>: Abbrev Number: 11 (DW_TAG_structure_type)
    <1c3>   DW_AT_byte_size   : 40
    <1c4>   DW_AT_decl_file   : 7
    <1c5>   DW_AT_decl_line   : 424
    <1c7>   DW_AT_decl_column : 9
    <1c8>   DW_AT_sibling     : <0x258>
 <2><1cc>: Abbrev Number: 12 (DW_TAG_member)
    <1cd>   DW_AT_name        : CR
    <1d0>   DW_AT_decl_file   : 7
    <1d1>   DW_AT_decl_line   : 426
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xde>
    <1d8>   DW_AT_data_member_location: 0
 <2><1d9>: Abbrev Number: 13 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x529b6): CFGR
    <1de>   DW_AT_decl_file   : 7
    <1df>   DW_AT_decl_line   : 427
    <1e1>   DW_AT_decl_column : 17
    <1e2>   DW_AT_type        : <0xde>
    <1e6>   DW_AT_data_member_location: 4
 <2><1e7>: Abbrev Number: 12 (DW_TAG_member)
    <1e8>   DW_AT_name        : CIR
    <1ec>   DW_AT_decl_file   : 7
    <1ed>   DW_AT_decl_line   : 428
    <1ef>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0xde>
    <1f4>   DW_AT_data_member_location: 8
 <2><1f5>: Abbrev Number: 13 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x3bbe3): APB2RSTR
    <1fa>   DW_AT_decl_file   : 7
    <1fb>   DW_AT_decl_line   : 429
    <1fd>   DW_AT_decl_column : 17
    <1fe>   DW_AT_type        : <0xde>
    <202>   DW_AT_data_member_location: 12
 <2><203>: Abbrev Number: 13 (DW_TAG_member)
    <204>   DW_AT_name        : (indirect string, offset: 0xf886): APB1RSTR
    <208>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 430
    <20b>   DW_AT_decl_column : 17
    <20c>   DW_AT_type        : <0xde>
    <210>   DW_AT_data_member_location: 16
 <2><211>: Abbrev Number: 13 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0xcb44): AHBENR
    <216>   DW_AT_decl_file   : 7
    <217>   DW_AT_decl_line   : 431
    <219>   DW_AT_decl_column : 17
    <21a>   DW_AT_type        : <0xde>
    <21e>   DW_AT_data_member_location: 20
 <2><21f>: Abbrev Number: 13 (DW_TAG_member)
    <220>   DW_AT_name        : (indirect string, offset: 0x103b4): APB2ENR
    <224>   DW_AT_decl_file   : 7
    <225>   DW_AT_decl_line   : 432
    <227>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xde>
    <22c>   DW_AT_data_member_location: 24
 <2><22d>: Abbrev Number: 13 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x66740): APB1ENR
    <232>   DW_AT_decl_file   : 7
    <233>   DW_AT_decl_line   : 433
    <235>   DW_AT_decl_column : 17
    <236>   DW_AT_type        : <0xde>
    <23a>   DW_AT_data_member_location: 28
 <2><23b>: Abbrev Number: 13 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x12b54): BDCR
    <240>   DW_AT_decl_file   : 7
    <241>   DW_AT_decl_line   : 434
    <243>   DW_AT_decl_column : 17
    <244>   DW_AT_type        : <0xde>
    <248>   DW_AT_data_member_location: 32
 <2><249>: Abbrev Number: 12 (DW_TAG_member)
    <24a>   DW_AT_name        : CSR
    <24e>   DW_AT_decl_file   : 7
    <24f>   DW_AT_decl_line   : 435
    <251>   DW_AT_decl_column : 17
    <252>   DW_AT_type        : <0xde>
    <256>   DW_AT_data_member_location: 36
 <2><257>: Abbrev Number: 0
 <1><258>: Abbrev Number: 14 (DW_TAG_typedef)
    <259>   DW_AT_name        : (indirect string, offset: 0x3f956): RCC_TypeDef
    <25d>   DW_AT_decl_file   : 7
    <25e>   DW_AT_decl_line   : 438
    <260>   DW_AT_decl_column : 3
    <261>   DW_AT_type        : <0x1c2>
 <1><265>: Abbrev Number: 11 (DW_TAG_structure_type)
    <266>   DW_AT_byte_size   : 84
    <267>   DW_AT_decl_file   : 7
    <268>   DW_AT_decl_line   : 477
    <26a>   DW_AT_decl_column : 9
    <26b>   DW_AT_sibling     : <0x394>
 <2><26f>: Abbrev Number: 12 (DW_TAG_member)
    <270>   DW_AT_name        : CR1
    <274>   DW_AT_decl_file   : 7
    <275>   DW_AT_decl_line   : 479
    <277>   DW_AT_decl_column : 17
    <278>   DW_AT_type        : <0xde>
    <27c>   DW_AT_data_member_location: 0
 <2><27d>: Abbrev Number: 12 (DW_TAG_member)
    <27e>   DW_AT_name        : CR2
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 480
    <285>   DW_AT_decl_column : 17
    <286>   DW_AT_type        : <0xde>
    <28a>   DW_AT_data_member_location: 4
 <2><28b>: Abbrev Number: 13 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x61fa2): SMCR
    <290>   DW_AT_decl_file   : 7
    <291>   DW_AT_decl_line   : 481
    <293>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0xde>
    <298>   DW_AT_data_member_location: 8
 <2><299>: Abbrev Number: 13 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x2bc03): DIER
    <29e>   DW_AT_decl_file   : 7
    <29f>   DW_AT_decl_line   : 482
    <2a1>   DW_AT_decl_column : 17
    <2a2>   DW_AT_type        : <0xde>
    <2a6>   DW_AT_data_member_location: 12
 <2><2a7>: Abbrev Number: 12 (DW_TAG_member)
    <2a8>   DW_AT_name        : SR
    <2ab>   DW_AT_decl_file   : 7
    <2ac>   DW_AT_decl_line   : 483
    <2ae>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0xde>
    <2b3>   DW_AT_data_member_location: 16
 <2><2b4>: Abbrev Number: 12 (DW_TAG_member)
    <2b5>   DW_AT_name        : EGR
    <2b9>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 484
    <2bc>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0xde>
    <2c1>   DW_AT_data_member_location: 20
 <2><2c2>: Abbrev Number: 13 (DW_TAG_member)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x63b31): CCMR1
    <2c7>   DW_AT_decl_file   : 7
    <2c8>   DW_AT_decl_line   : 485
    <2ca>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0xde>
    <2cf>   DW_AT_data_member_location: 24
 <2><2d0>: Abbrev Number: 13 (DW_TAG_member)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x36976): CCMR2
    <2d5>   DW_AT_decl_file   : 7
    <2d6>   DW_AT_decl_line   : 486
    <2d8>   DW_AT_decl_column : 17
    <2d9>   DW_AT_type        : <0xde>
    <2dd>   DW_AT_data_member_location: 28
 <2><2de>: Abbrev Number: 13 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x17ee4): CCER
    <2e3>   DW_AT_decl_file   : 7
    <2e4>   DW_AT_decl_line   : 487
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0xde>
    <2eb>   DW_AT_data_member_location: 32
 <2><2ec>: Abbrev Number: 12 (DW_TAG_member)
    <2ed>   DW_AT_name        : CNT
    <2f1>   DW_AT_decl_file   : 7
    <2f2>   DW_AT_decl_line   : 488
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0xde>
    <2f9>   DW_AT_data_member_location: 36
 <2><2fa>: Abbrev Number: 12 (DW_TAG_member)
    <2fb>   DW_AT_name        : PSC
    <2ff>   DW_AT_decl_file   : 7
    <300>   DW_AT_decl_line   : 489
    <302>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0xde>
    <307>   DW_AT_data_member_location: 40
 <2><308>: Abbrev Number: 12 (DW_TAG_member)
    <309>   DW_AT_name        : ARR
    <30d>   DW_AT_decl_file   : 7
    <30e>   DW_AT_decl_line   : 490
    <310>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0xde>
    <315>   DW_AT_data_member_location: 44
 <2><316>: Abbrev Number: 12 (DW_TAG_member)
    <317>   DW_AT_name        : RCR
    <31b>   DW_AT_decl_file   : 7
    <31c>   DW_AT_decl_line   : 491
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xde>
    <323>   DW_AT_data_member_location: 48
 <2><324>: Abbrev Number: 13 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x103af): CCR1
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 492
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0xde>
    <331>   DW_AT_data_member_location: 52
 <2><332>: Abbrev Number: 13 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x39aa4): CCR2
    <337>   DW_AT_decl_file   : 7
    <338>   DW_AT_decl_line   : 493
    <33a>   DW_AT_decl_column : 17
    <33b>   DW_AT_type        : <0xde>
    <33f>   DW_AT_data_member_location: 56
 <2><340>: Abbrev Number: 13 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x6844d): CCR3
    <345>   DW_AT_decl_file   : 7
    <346>   DW_AT_decl_line   : 494
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0xde>
    <34d>   DW_AT_data_member_location: 60
 <2><34e>: Abbrev Number: 13 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x8a42): CCR4
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 495
    <356>   DW_AT_decl_column : 17
    <357>   DW_AT_type        : <0xde>
    <35b>   DW_AT_data_member_location: 64
 <2><35c>: Abbrev Number: 13 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x3f382): BDTR
    <361>   DW_AT_decl_file   : 7
    <362>   DW_AT_decl_line   : 496
    <364>   DW_AT_decl_column : 17
    <365>   DW_AT_type        : <0xde>
    <369>   DW_AT_data_member_location: 68
 <2><36a>: Abbrev Number: 12 (DW_TAG_member)
    <36b>   DW_AT_name        : DCR
    <36f>   DW_AT_decl_file   : 7
    <370>   DW_AT_decl_line   : 497
    <372>   DW_AT_decl_column : 17
    <373>   DW_AT_type        : <0xde>
    <377>   DW_AT_data_member_location: 72
 <2><378>: Abbrev Number: 13 (DW_TAG_member)
    <379>   DW_AT_name        : (indirect string, offset: 0x74b4e): DMAR
    <37d>   DW_AT_decl_file   : 7
    <37e>   DW_AT_decl_line   : 498
    <380>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xde>
    <385>   DW_AT_data_member_location: 76
 <2><386>: Abbrev Number: 12 (DW_TAG_member)
    <387>   DW_AT_name        : OR
    <38a>   DW_AT_decl_file   : 7
    <38b>   DW_AT_decl_line   : 499
    <38d>   DW_AT_decl_column : 17
    <38e>   DW_AT_type        : <0xde>
    <392>   DW_AT_data_member_location: 80
 <2><393>: Abbrev Number: 0
 <1><394>: Abbrev Number: 14 (DW_TAG_typedef)
    <395>   DW_AT_name        : (indirect string, offset: 0x1cfc7): TIM_TypeDef
    <399>   DW_AT_decl_file   : 7
    <39a>   DW_AT_decl_line   : 500
    <39c>   DW_AT_decl_column : 2
    <39d>   DW_AT_type        : <0x265>
 <1><3a1>: Abbrev Number: 11 (DW_TAG_structure_type)
    <3a2>   DW_AT_byte_size   : 28
    <3a3>   DW_AT_decl_file   : 7
    <3a4>   DW_AT_decl_line   : 507
    <3a6>   DW_AT_decl_column : 9
    <3a7>   DW_AT_sibling     : <0x40c>
 <2><3ab>: Abbrev Number: 12 (DW_TAG_member)
    <3ac>   DW_AT_name        : SR
    <3af>   DW_AT_decl_file   : 7
    <3b0>   DW_AT_decl_line   : 509
    <3b2>   DW_AT_decl_column : 17
    <3b3>   DW_AT_type        : <0xde>
    <3b7>   DW_AT_data_member_location: 0
 <2><3b8>: Abbrev Number: 12 (DW_TAG_member)
    <3b9>   DW_AT_name        : DR
    <3bc>   DW_AT_decl_file   : 7
    <3bd>   DW_AT_decl_line   : 510
    <3bf>   DW_AT_decl_column : 17
    <3c0>   DW_AT_type        : <0xde>
    <3c4>   DW_AT_data_member_location: 4
 <2><3c5>: Abbrev Number: 12 (DW_TAG_member)
    <3c6>   DW_AT_name        : BRR
    <3ca>   DW_AT_decl_file   : 7
    <3cb>   DW_AT_decl_line   : 511
    <3cd>   DW_AT_decl_column : 17
    <3ce>   DW_AT_type        : <0xde>
    <3d2>   DW_AT_data_member_location: 8
 <2><3d3>: Abbrev Number: 12 (DW_TAG_member)
    <3d4>   DW_AT_name        : CR1
    <3d8>   DW_AT_decl_file   : 7
    <3d9>   DW_AT_decl_line   : 512
    <3db>   DW_AT_decl_column : 17
    <3dc>   DW_AT_type        : <0xde>
    <3e0>   DW_AT_data_member_location: 12
 <2><3e1>: Abbrev Number: 12 (DW_TAG_member)
    <3e2>   DW_AT_name        : CR2
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 513
    <3e9>   DW_AT_decl_column : 17
    <3ea>   DW_AT_type        : <0xde>
    <3ee>   DW_AT_data_member_location: 16
 <2><3ef>: Abbrev Number: 12 (DW_TAG_member)
    <3f0>   DW_AT_name        : CR3
    <3f4>   DW_AT_decl_file   : 7
    <3f5>   DW_AT_decl_line   : 514
    <3f7>   DW_AT_decl_column : 17
    <3f8>   DW_AT_type        : <0xde>
    <3fc>   DW_AT_data_member_location: 20
 <2><3fd>: Abbrev Number: 13 (DW_TAG_member)
    <3fe>   DW_AT_name        : (indirect string, offset: 0x25e21): GTPR
    <402>   DW_AT_decl_file   : 7
    <403>   DW_AT_decl_line   : 515
    <405>   DW_AT_decl_column : 17
    <406>   DW_AT_type        : <0xde>
    <40a>   DW_AT_data_member_location: 24
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 14 (DW_TAG_typedef)
    <40d>   DW_AT_name        : (indirect string, offset: 0x85d42): USART_TypeDef
    <411>   DW_AT_decl_file   : 7
    <412>   DW_AT_decl_line   : 516
    <414>   DW_AT_decl_column : 3
    <415>   DW_AT_type        : <0x3a1>
 <1><419>: Abbrev Number: 2 (DW_TAG_base_type)
    <41a>   DW_AT_byte_size   : 8
    <41b>   DW_AT_encoding    : 4	(float)
    <41c>   DW_AT_name        : (indirect string, offset: 0x31a7f): long double
 <1><420>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <421>   DW_AT_encoding    : 7	(unsigned)
    <422>   DW_AT_byte_size   : 1
    <423>   DW_AT_type        : <0x3c>
    <427>   DW_AT_decl_file   : 8
    <428>   DW_AT_decl_line   : 40
    <429>   DW_AT_decl_column : 1
    <42a>   DW_AT_sibling     : <0x447>
 <2><42e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <42f>   DW_AT_name        : (indirect string, offset: 0x2e249): HAL_OK
    <433>   DW_AT_const_value : 0
 <2><434>: Abbrev Number: 16 (DW_TAG_enumerator)
    <435>   DW_AT_name        : (indirect string, offset: 0x551cf): HAL_ERROR
    <439>   DW_AT_const_value : 1
 <2><43a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <43b>   DW_AT_name        : (indirect string, offset: 0x17aec): HAL_BUSY
    <43f>   DW_AT_const_value : 2
 <2><440>: Abbrev Number: 16 (DW_TAG_enumerator)
    <441>   DW_AT_name        : (indirect string, offset: 0x282f8): HAL_TIMEOUT
    <445>   DW_AT_const_value : 3
 <2><446>: Abbrev Number: 0
 <1><447>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <448>   DW_AT_encoding    : 7	(unsigned)
    <449>   DW_AT_byte_size   : 1
    <44a>   DW_AT_type        : <0x3c>
    <44e>   DW_AT_decl_file   : 8
    <44f>   DW_AT_decl_line   : 51
    <450>   DW_AT_decl_column : 1
    <451>   DW_AT_sibling     : <0x462>
 <2><455>: Abbrev Number: 16 (DW_TAG_enumerator)
    <456>   DW_AT_name        : (indirect string, offset: 0x64a6c): HAL_UNLOCKED
    <45a>   DW_AT_const_value : 0
 <2><45b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <45c>   DW_AT_name        : (indirect string, offset: 0x86e76): HAL_LOCKED
    <460>   DW_AT_const_value : 1
 <2><461>: Abbrev Number: 0
 <1><462>: Abbrev Number: 3 (DW_TAG_typedef)
    <463>   DW_AT_name        : (indirect string, offset: 0x50316): HAL_LockTypeDef
    <467>   DW_AT_decl_file   : 8
    <468>   DW_AT_decl_line   : 54
    <469>   DW_AT_decl_column : 3
    <46a>   DW_AT_type        : <0x447>
 <1><46e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <46f>   DW_AT_byte_size   : 12
    <470>   DW_AT_decl_file   : 9
    <471>   DW_AT_decl_line   : 49
    <472>   DW_AT_decl_column : 9
    <473>   DW_AT_sibling     : <0x49f>
 <2><477>: Abbrev Number: 18 (DW_TAG_member)
    <478>   DW_AT_name        : (indirect string, offset: 0x5b404): PLLState
    <47c>   DW_AT_decl_file   : 9
    <47d>   DW_AT_decl_line   : 51
    <47e>   DW_AT_decl_column : 12
    <47f>   DW_AT_type        : <0xd2>
    <483>   DW_AT_data_member_location: 0
 <2><484>: Abbrev Number: 18 (DW_TAG_member)
    <485>   DW_AT_name        : (indirect string, offset: 0x5c70d): PLLSource
    <489>   DW_AT_decl_file   : 9
    <48a>   DW_AT_decl_line   : 54
    <48b>   DW_AT_decl_column : 12
    <48c>   DW_AT_type        : <0xd2>
    <490>   DW_AT_data_member_location: 4
 <2><491>: Abbrev Number: 18 (DW_TAG_member)
    <492>   DW_AT_name        : (indirect string, offset: 0x79af9): PLLMUL
    <496>   DW_AT_decl_file   : 9
    <497>   DW_AT_decl_line   : 57
    <498>   DW_AT_decl_column : 12
    <499>   DW_AT_type        : <0xd2>
    <49d>   DW_AT_data_member_location: 8
 <2><49e>: Abbrev Number: 0
 <1><49f>: Abbrev Number: 3 (DW_TAG_typedef)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x52740): RCC_PLLInitTypeDef
    <4a4>   DW_AT_decl_file   : 9
    <4a5>   DW_AT_decl_line   : 59
    <4a6>   DW_AT_decl_column : 3
    <4a7>   DW_AT_type        : <0x46e>
 <1><4ab>: Abbrev Number: 17 (DW_TAG_structure_type)
    <4ac>   DW_AT_byte_size   : 20
    <4ad>   DW_AT_decl_file   : 9
    <4ae>   DW_AT_decl_line   : 64
    <4af>   DW_AT_decl_column : 9
    <4b0>   DW_AT_sibling     : <0x4f6>
 <2><4b4>: Abbrev Number: 18 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x2a057): ClockType
    <4b9>   DW_AT_decl_file   : 9
    <4ba>   DW_AT_decl_line   : 66
    <4bb>   DW_AT_decl_column : 12
    <4bc>   DW_AT_type        : <0xd2>
    <4c0>   DW_AT_data_member_location: 0
 <2><4c1>: Abbrev Number: 18 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x5236b): SYSCLKSource
    <4c6>   DW_AT_decl_file   : 9
    <4c7>   DW_AT_decl_line   : 69
    <4c8>   DW_AT_decl_column : 12
    <4c9>   DW_AT_type        : <0xd2>
    <4cd>   DW_AT_data_member_location: 4
 <2><4ce>: Abbrev Number: 18 (DW_TAG_member)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x707f6): AHBCLKDivider
    <4d3>   DW_AT_decl_file   : 9
    <4d4>   DW_AT_decl_line   : 72
    <4d5>   DW_AT_decl_column : 12
    <4d6>   DW_AT_type        : <0xd2>
    <4da>   DW_AT_data_member_location: 8
 <2><4db>: Abbrev Number: 18 (DW_TAG_member)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x5571): APB1CLKDivider
    <4e0>   DW_AT_decl_file   : 9
    <4e1>   DW_AT_decl_line   : 75
    <4e2>   DW_AT_decl_column : 12
    <4e3>   DW_AT_type        : <0xd2>
    <4e7>   DW_AT_data_member_location: 12
 <2><4e8>: Abbrev Number: 18 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0x3ef1e): APB2CLKDivider
    <4ed>   DW_AT_decl_file   : 9
    <4ee>   DW_AT_decl_line   : 78
    <4ef>   DW_AT_decl_column : 12
    <4f0>   DW_AT_type        : <0xd2>
    <4f4>   DW_AT_data_member_location: 16
 <2><4f5>: Abbrev Number: 0
 <1><4f6>: Abbrev Number: 3 (DW_TAG_typedef)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x2a0a4): RCC_ClkInitTypeDef
    <4fb>   DW_AT_decl_file   : 9
    <4fc>   DW_AT_decl_line   : 80
    <4fd>   DW_AT_decl_column : 3
    <4fe>   DW_AT_type        : <0x4ab>
 <1><502>: Abbrev Number: 17 (DW_TAG_structure_type)
    <503>   DW_AT_byte_size   : 40
    <504>   DW_AT_decl_file   : 10
    <505>   DW_AT_decl_line   : 228
    <506>   DW_AT_decl_column : 9
    <507>   DW_AT_sibling     : <0x575>
 <2><50b>: Abbrev Number: 18 (DW_TAG_member)
    <50c>   DW_AT_name        : (indirect string, offset: 0x6edf7): OscillatorType
    <510>   DW_AT_decl_file   : 10
    <511>   DW_AT_decl_line   : 230
    <512>   DW_AT_decl_column : 12
    <513>   DW_AT_type        : <0xd2>
    <517>   DW_AT_data_member_location: 0
 <2><518>: Abbrev Number: 18 (DW_TAG_member)
    <519>   DW_AT_name        : (indirect string, offset: 0x5c5fb): HSEState
    <51d>   DW_AT_decl_file   : 10
    <51e>   DW_AT_decl_line   : 238
    <51f>   DW_AT_decl_column : 12
    <520>   DW_AT_type        : <0xd2>
    <524>   DW_AT_data_member_location: 4
 <2><525>: Abbrev Number: 18 (DW_TAG_member)
    <526>   DW_AT_name        : (indirect string, offset: 0x5bb2e): HSEPredivValue
    <52a>   DW_AT_decl_file   : 10
    <52b>   DW_AT_decl_line   : 241
    <52c>   DW_AT_decl_column : 12
    <52d>   DW_AT_type        : <0xd2>
    <531>   DW_AT_data_member_location: 8
 <2><532>: Abbrev Number: 18 (DW_TAG_member)
    <533>   DW_AT_name        : (indirect string, offset: 0x557b5): LSEState
    <537>   DW_AT_decl_file   : 10
    <538>   DW_AT_decl_line   : 244
    <539>   DW_AT_decl_column : 12
    <53a>   DW_AT_type        : <0xd2>
    <53e>   DW_AT_data_member_location: 12
 <2><53f>: Abbrev Number: 18 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x3d4ed): HSIState
    <544>   DW_AT_decl_file   : 10
    <545>   DW_AT_decl_line   : 247
    <546>   DW_AT_decl_column : 12
    <547>   DW_AT_type        : <0xd2>
    <54b>   DW_AT_data_member_location: 16
 <2><54c>: Abbrev Number: 18 (DW_TAG_member)
    <54d>   DW_AT_name        : (indirect string, offset: 0x74cf1): HSICalibrationValue
    <551>   DW_AT_decl_file   : 10
    <552>   DW_AT_decl_line   : 250
    <553>   DW_AT_decl_column : 12
    <554>   DW_AT_type        : <0xd2>
    <558>   DW_AT_data_member_location: 20
 <2><559>: Abbrev Number: 18 (DW_TAG_member)
    <55a>   DW_AT_name        : (indirect string, offset: 0x79025): LSIState
    <55e>   DW_AT_decl_file   : 10
    <55f>   DW_AT_decl_line   : 253
    <560>   DW_AT_decl_column : 12
    <561>   DW_AT_type        : <0xd2>
    <565>   DW_AT_data_member_location: 24
 <2><566>: Abbrev Number: 12 (DW_TAG_member)
    <567>   DW_AT_name        : PLL
    <56b>   DW_AT_decl_file   : 10
    <56c>   DW_AT_decl_line   : 256
    <56e>   DW_AT_decl_column : 22
    <56f>   DW_AT_type        : <0x49f>
    <573>   DW_AT_data_member_location: 28
 <2><574>: Abbrev Number: 0
 <1><575>: Abbrev Number: 14 (DW_TAG_typedef)
    <576>   DW_AT_name        : (indirect string, offset: 0x4887d): RCC_OscInitTypeDef
    <57a>   DW_AT_decl_file   : 10
    <57b>   DW_AT_decl_line   : 261
    <57d>   DW_AT_decl_column : 3
    <57e>   DW_AT_type        : <0x502>
 <1><582>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <583>   DW_AT_prototyped  : 1
 <1><583>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <584>   DW_AT_byte_size   : 4
    <585>   DW_AT_type        : <0x582>
 <1><589>: Abbrev Number: 17 (DW_TAG_structure_type)
    <58a>   DW_AT_byte_size   : 28
    <58b>   DW_AT_decl_file   : 11
    <58c>   DW_AT_decl_line   : 48
    <58d>   DW_AT_decl_column : 9
    <58e>   DW_AT_sibling     : <0x5ee>
 <2><592>: Abbrev Number: 18 (DW_TAG_member)
    <593>   DW_AT_name        : (indirect string, offset: 0x328a4): Direction
    <597>   DW_AT_decl_file   : 11
    <598>   DW_AT_decl_line   : 50
    <599>   DW_AT_decl_column : 12
    <59a>   DW_AT_type        : <0xd2>
    <59e>   DW_AT_data_member_location: 0
 <2><59f>: Abbrev Number: 18 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x9421): PeriphInc
    <5a4>   DW_AT_decl_file   : 11
    <5a5>   DW_AT_decl_line   : 54
    <5a6>   DW_AT_decl_column : 12
    <5a7>   DW_AT_type        : <0xd2>
    <5ab>   DW_AT_data_member_location: 4
 <2><5ac>: Abbrev Number: 18 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x154a2): MemInc
    <5b1>   DW_AT_decl_file   : 11
    <5b2>   DW_AT_decl_line   : 57
    <5b3>   DW_AT_decl_column : 12
    <5b4>   DW_AT_type        : <0xd2>
    <5b8>   DW_AT_data_member_location: 8
 <2><5b9>: Abbrev Number: 18 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0x43e21): PeriphDataAlignment
    <5be>   DW_AT_decl_file   : 11
    <5bf>   DW_AT_decl_line   : 60
    <5c0>   DW_AT_decl_column : 12
    <5c1>   DW_AT_type        : <0xd2>
    <5c5>   DW_AT_data_member_location: 12
 <2><5c6>: Abbrev Number: 18 (DW_TAG_member)
    <5c7>   DW_AT_name        : (indirect string, offset: 0x7a5e0): MemDataAlignment
    <5cb>   DW_AT_decl_file   : 11
    <5cc>   DW_AT_decl_line   : 63
    <5cd>   DW_AT_decl_column : 12
    <5ce>   DW_AT_type        : <0xd2>
    <5d2>   DW_AT_data_member_location: 16
 <2><5d3>: Abbrev Number: 18 (DW_TAG_member)
    <5d4>   DW_AT_name        : (indirect string, offset: 0x89095): Mode
    <5d8>   DW_AT_decl_file   : 11
    <5d9>   DW_AT_decl_line   : 66
    <5da>   DW_AT_decl_column : 12
    <5db>   DW_AT_type        : <0xd2>
    <5df>   DW_AT_data_member_location: 20
 <2><5e0>: Abbrev Number: 18 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x882c6): Priority
    <5e5>   DW_AT_decl_file   : 11
    <5e6>   DW_AT_decl_line   : 71
    <5e7>   DW_AT_decl_column : 12
    <5e8>   DW_AT_type        : <0xd2>
    <5ec>   DW_AT_data_member_location: 24
 <2><5ed>: Abbrev Number: 0
 <1><5ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ef>   DW_AT_name        : (indirect string, offset: 0x247ce): DMA_InitTypeDef
    <5f3>   DW_AT_decl_file   : 11
    <5f4>   DW_AT_decl_line   : 73
    <5f5>   DW_AT_decl_column : 3
    <5f6>   DW_AT_type        : <0x589>
 <1><5fa>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <5fb>   DW_AT_encoding    : 7	(unsigned)
    <5fc>   DW_AT_byte_size   : 1
    <5fd>   DW_AT_type        : <0x3c>
    <601>   DW_AT_decl_file   : 11
    <602>   DW_AT_decl_line   : 79
    <603>   DW_AT_decl_column : 1
    <604>   DW_AT_sibling     : <0x621>
 <2><608>: Abbrev Number: 16 (DW_TAG_enumerator)
    <609>   DW_AT_name        : (indirect string, offset: 0x65a2d): HAL_DMA_STATE_RESET
    <60d>   DW_AT_const_value : 0
 <2><60e>: Abbrev Number: 16 (DW_TAG_enumerator)
    <60f>   DW_AT_name        : (indirect string, offset: 0x25607): HAL_DMA_STATE_READY
    <613>   DW_AT_const_value : 1
 <2><614>: Abbrev Number: 16 (DW_TAG_enumerator)
    <615>   DW_AT_name        : (indirect string, offset: 0x5e6f6): HAL_DMA_STATE_BUSY
    <619>   DW_AT_const_value : 2
 <2><61a>: Abbrev Number: 16 (DW_TAG_enumerator)
    <61b>   DW_AT_name        : (indirect string, offset: 0x84b80): HAL_DMA_STATE_TIMEOUT
    <61f>   DW_AT_const_value : 3
 <2><620>: Abbrev Number: 0
 <1><621>: Abbrev Number: 3 (DW_TAG_typedef)
    <622>   DW_AT_name        : (indirect string, offset: 0x5aa9e): HAL_DMA_StateTypeDef
    <626>   DW_AT_decl_file   : 11
    <627>   DW_AT_decl_line   : 84
    <628>   DW_AT_decl_column : 2
    <629>   DW_AT_type        : <0x5fa>
 <1><62d>: Abbrev Number: 21 (DW_TAG_structure_type)
    <62e>   DW_AT_name        : (indirect string, offset: 0x73b05): __DMA_HandleTypeDef
    <632>   DW_AT_byte_size   : 68
    <633>   DW_AT_decl_file   : 11
    <634>   DW_AT_decl_line   : 111
    <635>   DW_AT_decl_column : 16
    <636>   DW_AT_sibling     : <0x6d7>
 <2><63a>: Abbrev Number: 18 (DW_TAG_member)
    <63b>   DW_AT_name        : (indirect string, offset: 0x353d7): Instance
    <63f>   DW_AT_decl_file   : 11
    <640>   DW_AT_decl_line   : 113
    <641>   DW_AT_decl_column : 26
    <642>   DW_AT_type        : <0x6d7>
    <646>   DW_AT_data_member_location: 0
 <2><647>: Abbrev Number: 18 (DW_TAG_member)
    <648>   DW_AT_name        : (indirect string, offset: 0x10088): Init
    <64c>   DW_AT_decl_file   : 11
    <64d>   DW_AT_decl_line   : 115
    <64e>   DW_AT_decl_column : 25
    <64f>   DW_AT_type        : <0x5ee>
    <653>   DW_AT_data_member_location: 4
 <2><654>: Abbrev Number: 18 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0x61306): Lock
    <659>   DW_AT_decl_file   : 11
    <65a>   DW_AT_decl_line   : 117
    <65b>   DW_AT_decl_column : 25
    <65c>   DW_AT_type        : <0x462>
    <660>   DW_AT_data_member_location: 32
 <2><661>: Abbrev Number: 18 (DW_TAG_member)
    <662>   DW_AT_name        : (indirect string, offset: 0x5c5fe): State
    <666>   DW_AT_decl_file   : 11
    <667>   DW_AT_decl_line   : 119
    <668>   DW_AT_decl_column : 25
    <669>   DW_AT_type        : <0x621>
    <66d>   DW_AT_data_member_location: 33
 <2><66e>: Abbrev Number: 18 (DW_TAG_member)
    <66f>   DW_AT_name        : (indirect string, offset: 0x60b7): Parent
    <673>   DW_AT_decl_file   : 11
    <674>   DW_AT_decl_line   : 121
    <675>   DW_AT_decl_column : 26
    <676>   DW_AT_type        : <0x6dd>
    <67a>   DW_AT_data_member_location: 36
 <2><67b>: Abbrev Number: 18 (DW_TAG_member)
    <67c>   DW_AT_name        : (indirect string, offset: 0x8648c): XferCpltCallback
    <680>   DW_AT_decl_file   : 11
    <681>   DW_AT_decl_line   : 123
    <682>   DW_AT_decl_column : 28
    <683>   DW_AT_type        : <0x6f0>
    <687>   DW_AT_data_member_location: 40
 <2><688>: Abbrev Number: 18 (DW_TAG_member)
    <689>   DW_AT_name        : (indirect string, offset: 0x69c7f): XferHalfCpltCallback
    <68d>   DW_AT_decl_file   : 11
    <68e>   DW_AT_decl_line   : 125
    <68f>   DW_AT_decl_column : 28
    <690>   DW_AT_type        : <0x6f0>
    <694>   DW_AT_data_member_location: 44
 <2><695>: Abbrev Number: 18 (DW_TAG_member)
    <696>   DW_AT_name        : (indirect string, offset: 0x13673): XferErrorCallback
    <69a>   DW_AT_decl_file   : 11
    <69b>   DW_AT_decl_line   : 127
    <69c>   DW_AT_decl_column : 28
    <69d>   DW_AT_type        : <0x6f0>
    <6a1>   DW_AT_data_member_location: 48
 <2><6a2>: Abbrev Number: 18 (DW_TAG_member)
    <6a3>   DW_AT_name        : (indirect string, offset: 0x7e366): XferAbortCallback
    <6a7>   DW_AT_decl_file   : 11
    <6a8>   DW_AT_decl_line   : 129
    <6a9>   DW_AT_decl_column : 28
    <6aa>   DW_AT_type        : <0x6f0>
    <6ae>   DW_AT_data_member_location: 52
 <2><6af>: Abbrev Number: 18 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x83eb3): ErrorCode
    <6b4>   DW_AT_decl_file   : 11
    <6b5>   DW_AT_decl_line   : 131
    <6b6>   DW_AT_decl_column : 25
    <6b7>   DW_AT_type        : <0xde>
    <6bb>   DW_AT_data_member_location: 56
 <2><6bc>: Abbrev Number: 18 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x3a89b): DmaBaseAddress
    <6c1>   DW_AT_decl_file   : 11
    <6c2>   DW_AT_decl_line   : 133
    <6c3>   DW_AT_decl_column : 27
    <6c4>   DW_AT_type        : <0x6f6>
    <6c8>   DW_AT_data_member_location: 60
 <2><6c9>: Abbrev Number: 18 (DW_TAG_member)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x1bfb3): ChannelIndex
    <6ce>   DW_AT_decl_file   : 11
    <6cf>   DW_AT_decl_line   : 135
    <6d0>   DW_AT_decl_column : 26
    <6d1>   DW_AT_type        : <0xd2>
    <6d5>   DW_AT_data_member_location: 64
 <2><6d6>: Abbrev Number: 0
 <1><6d7>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6d8>   DW_AT_byte_size   : 4
    <6d9>   DW_AT_type        : <0x181>
 <1><6dd>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <6de>   DW_AT_byte_size   : 4
 <1><6df>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <6e0>   DW_AT_prototyped  : 1
    <6e0>   DW_AT_sibling     : <0x6ea>
 <2><6e4>: Abbrev Number: 24 (DW_TAG_formal_parameter)
    <6e5>   DW_AT_type        : <0x6ea>
 <2><6e9>: Abbrev Number: 0
 <1><6ea>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6eb>   DW_AT_byte_size   : 4
    <6ec>   DW_AT_type        : <0x62d>
 <1><6f0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6f1>   DW_AT_byte_size   : 4
    <6f2>   DW_AT_type        : <0x6df>
 <1><6f6>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <6f7>   DW_AT_byte_size   : 4
    <6f8>   DW_AT_type        : <0x1b5>
 <1><6fc>: Abbrev Number: 3 (DW_TAG_typedef)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x73b07): DMA_HandleTypeDef
    <701>   DW_AT_decl_file   : 11
    <702>   DW_AT_decl_line   : 137
    <703>   DW_AT_decl_column : 3
    <704>   DW_AT_type        : <0x62d>
 <1><708>: Abbrev Number: 17 (DW_TAG_structure_type)
    <709>   DW_AT_byte_size   : 24
    <70a>   DW_AT_decl_file   : 12
    <70b>   DW_AT_decl_line   : 47
    <70c>   DW_AT_decl_column : 9
    <70d>   DW_AT_sibling     : <0x760>
 <2><711>: Abbrev Number: 18 (DW_TAG_member)
    <712>   DW_AT_name        : (indirect string, offset: 0x89183): Prescaler
    <716>   DW_AT_decl_file   : 12
    <717>   DW_AT_decl_line   : 49
    <718>   DW_AT_decl_column : 12
    <719>   DW_AT_type        : <0xd2>
    <71d>   DW_AT_data_member_location: 0
 <2><71e>: Abbrev Number: 18 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x7b17a): CounterMode
    <723>   DW_AT_decl_file   : 12
    <724>   DW_AT_decl_line   : 52
    <725>   DW_AT_decl_column : 12
    <726>   DW_AT_type        : <0xd2>
    <72a>   DW_AT_data_member_location: 4
 <2><72b>: Abbrev Number: 18 (DW_TAG_member)
    <72c>   DW_AT_name        : (indirect string, offset: 0x10f44): Period
    <730>   DW_AT_decl_file   : 12
    <731>   DW_AT_decl_line   : 55
    <732>   DW_AT_decl_column : 12
    <733>   DW_AT_type        : <0xd2>
    <737>   DW_AT_data_member_location: 8
 <2><738>: Abbrev Number: 18 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0x37b57): ClockDivision
    <73d>   DW_AT_decl_file   : 12
    <73e>   DW_AT_decl_line   : 59
    <73f>   DW_AT_decl_column : 12
    <740>   DW_AT_type        : <0xd2>
    <744>   DW_AT_data_member_location: 12
 <2><745>: Abbrev Number: 18 (DW_TAG_member)
    <746>   DW_AT_name        : (indirect string, offset: 0x5f830): RepetitionCounter
    <74a>   DW_AT_decl_file   : 12
    <74b>   DW_AT_decl_line   : 62
    <74c>   DW_AT_decl_column : 12
    <74d>   DW_AT_type        : <0xd2>
    <751>   DW_AT_data_member_location: 16
 <2><752>: Abbrev Number: 18 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0xdb2a): AutoReloadPreload
    <757>   DW_AT_decl_file   : 12
    <758>   DW_AT_decl_line   : 73
    <759>   DW_AT_decl_column : 12
    <75a>   DW_AT_type        : <0xd2>
    <75e>   DW_AT_data_member_location: 20
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_typedef)
    <761>   DW_AT_name        : (indirect string, offset: 0x79696): TIM_Base_InitTypeDef
    <765>   DW_AT_decl_file   : 12
    <766>   DW_AT_decl_line   : 75
    <767>   DW_AT_decl_column : 3
    <768>   DW_AT_type        : <0x708>
 <1><76c>: Abbrev Number: 17 (DW_TAG_structure_type)
    <76d>   DW_AT_byte_size   : 16
    <76e>   DW_AT_decl_file   : 12
    <76f>   DW_AT_decl_line   : 148
    <770>   DW_AT_decl_column : 9
    <771>   DW_AT_sibling     : <0x7aa>
 <2><775>: Abbrev Number: 18 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0x88b93): ICPolarity
    <77a>   DW_AT_decl_file   : 12
    <77b>   DW_AT_decl_line   : 150
    <77c>   DW_AT_decl_column : 13
    <77d>   DW_AT_type        : <0xd2>
    <781>   DW_AT_data_member_location: 0
 <2><782>: Abbrev Number: 18 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x88cd1): ICSelection
    <787>   DW_AT_decl_file   : 12
    <788>   DW_AT_decl_line   : 153
    <789>   DW_AT_decl_column : 12
    <78a>   DW_AT_type        : <0xd2>
    <78e>   DW_AT_data_member_location: 4
 <2><78f>: Abbrev Number: 18 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0x189d7): ICPrescaler
    <794>   DW_AT_decl_file   : 12
    <795>   DW_AT_decl_line   : 156
    <796>   DW_AT_decl_column : 12
    <797>   DW_AT_type        : <0xd2>
    <79b>   DW_AT_data_member_location: 8
 <2><79c>: Abbrev Number: 18 (DW_TAG_member)
    <79d>   DW_AT_name        : (indirect string, offset: 0x88adb): ICFilter
    <7a1>   DW_AT_decl_file   : 12
    <7a2>   DW_AT_decl_line   : 159
    <7a3>   DW_AT_decl_column : 12
    <7a4>   DW_AT_type        : <0xd2>
    <7a8>   DW_AT_data_member_location: 12
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x3e851): TIM_IC_InitTypeDef
    <7af>   DW_AT_decl_file   : 12
    <7b0>   DW_AT_decl_line   : 161
    <7b1>   DW_AT_decl_column : 3
    <7b2>   DW_AT_type        : <0x76c>
 <1><7b6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7b7>   DW_AT_byte_size   : 8
    <7b8>   DW_AT_decl_file   : 12
    <7b9>   DW_AT_decl_line   : 232
    <7ba>   DW_AT_decl_column : 9
    <7bb>   DW_AT_sibling     : <0x7da>
 <2><7bf>: Abbrev Number: 18 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x502b2): MasterOutputTrigger
    <7c4>   DW_AT_decl_file   : 12
    <7c5>   DW_AT_decl_line   : 234
    <7c6>   DW_AT_decl_column : 13
    <7c7>   DW_AT_type        : <0xd2>
    <7cb>   DW_AT_data_member_location: 0
 <2><7cc>: Abbrev Number: 18 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0x47daf): MasterSlaveMode
    <7d1>   DW_AT_decl_file   : 12
    <7d2>   DW_AT_decl_line   : 236
    <7d3>   DW_AT_decl_column : 13
    <7d4>   DW_AT_type        : <0xd2>
    <7d8>   DW_AT_data_member_location: 4
 <2><7d9>: Abbrev Number: 0
 <1><7da>: Abbrev Number: 3 (DW_TAG_typedef)
    <7db>   DW_AT_name        : (indirect string, offset: 0x62984): TIM_MasterConfigTypeDef
    <7df>   DW_AT_decl_file   : 12
    <7e0>   DW_AT_decl_line   : 243
    <7e1>   DW_AT_decl_column : 3
    <7e2>   DW_AT_type        : <0x7b6>
 <1><7e6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7e7>   DW_AT_byte_size   : 20
    <7e8>   DW_AT_decl_file   : 12
    <7e9>   DW_AT_decl_line   : 248
    <7ea>   DW_AT_decl_column : 9
    <7eb>   DW_AT_sibling     : <0x833>
 <2><7ef>: Abbrev Number: 18 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x47db5): SlaveMode
    <7f4>   DW_AT_decl_file   : 12
    <7f5>   DW_AT_decl_line   : 250
    <7f6>   DW_AT_decl_column : 13
    <7f7>   DW_AT_type        : <0xd2>
    <7fb>   DW_AT_data_member_location: 0
 <2><7fc>: Abbrev Number: 18 (DW_TAG_member)
    <7fd>   DW_AT_name        : (indirect string, offset: 0x79087): InputTrigger
    <801>   DW_AT_decl_file   : 12
    <802>   DW_AT_decl_line   : 252
    <803>   DW_AT_decl_column : 13
    <804>   DW_AT_type        : <0xd2>
    <808>   DW_AT_data_member_location: 4
 <2><809>: Abbrev Number: 18 (DW_TAG_member)
    <80a>   DW_AT_name        : (indirect string, offset: 0x83e2e): TriggerPolarity
    <80e>   DW_AT_decl_file   : 12
    <80f>   DW_AT_decl_line   : 254
    <810>   DW_AT_decl_column : 13
    <811>   DW_AT_type        : <0xd2>
    <815>   DW_AT_data_member_location: 8
 <2><816>: Abbrev Number: 13 (DW_TAG_member)
    <817>   DW_AT_name        : (indirect string, offset: 0x3de3c): TriggerPrescaler
    <81b>   DW_AT_decl_file   : 12
    <81c>   DW_AT_decl_line   : 256
    <81e>   DW_AT_decl_column : 13
    <81f>   DW_AT_type        : <0xd2>
    <823>   DW_AT_data_member_location: 12
 <2><824>: Abbrev Number: 13 (DW_TAG_member)
    <825>   DW_AT_name        : (indirect string, offset: 0x67745): TriggerFilter
    <829>   DW_AT_decl_file   : 12
    <82a>   DW_AT_decl_line   : 258
    <82c>   DW_AT_decl_column : 13
    <82d>   DW_AT_type        : <0xd2>
    <831>   DW_AT_data_member_location: 16
 <2><832>: Abbrev Number: 0
 <1><833>: Abbrev Number: 14 (DW_TAG_typedef)
    <834>   DW_AT_name        : (indirect string, offset: 0x5e756): TIM_SlaveConfigTypeDef
    <838>   DW_AT_decl_file   : 12
    <839>   DW_AT_decl_line   : 261
    <83b>   DW_AT_decl_column : 3
    <83c>   DW_AT_type        : <0x7e6>
 <1><840>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <841>   DW_AT_encoding    : 7	(unsigned)
    <842>   DW_AT_byte_size   : 1
    <843>   DW_AT_type        : <0x3c>
    <847>   DW_AT_decl_file   : 12
    <848>   DW_AT_decl_line   : 292
    <84a>   DW_AT_decl_column : 1
    <84b>   DW_AT_sibling     : <0x86e>
 <2><84f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <850>   DW_AT_name        : (indirect string, offset: 0x44b3c): HAL_TIM_STATE_RESET
    <854>   DW_AT_const_value : 0
 <2><855>: Abbrev Number: 16 (DW_TAG_enumerator)
    <856>   DW_AT_name        : (indirect string, offset: 0x50b8): HAL_TIM_STATE_READY
    <85a>   DW_AT_const_value : 1
 <2><85b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <85c>   DW_AT_name        : (indirect string, offset: 0x222e3): HAL_TIM_STATE_BUSY
    <860>   DW_AT_const_value : 2
 <2><861>: Abbrev Number: 16 (DW_TAG_enumerator)
    <862>   DW_AT_name        : (indirect string, offset: 0x71bd7): HAL_TIM_STATE_TIMEOUT
    <866>   DW_AT_const_value : 3
 <2><867>: Abbrev Number: 16 (DW_TAG_enumerator)
    <868>   DW_AT_name        : (indirect string, offset: 0x31ef8): HAL_TIM_STATE_ERROR
    <86c>   DW_AT_const_value : 4
 <2><86d>: Abbrev Number: 0
 <1><86e>: Abbrev Number: 14 (DW_TAG_typedef)
    <86f>   DW_AT_name        : (indirect string, offset: 0x62c3f): HAL_TIM_StateTypeDef
    <873>   DW_AT_decl_file   : 12
    <874>   DW_AT_decl_line   : 298
    <876>   DW_AT_decl_column : 3
    <877>   DW_AT_type        : <0x840>
 <1><87b>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <87c>   DW_AT_type        : <0x86e>
 <1><880>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <881>   DW_AT_encoding    : 7	(unsigned)
    <882>   DW_AT_byte_size   : 1
    <883>   DW_AT_type        : <0x3c>
    <887>   DW_AT_decl_file   : 12
    <888>   DW_AT_decl_line   : 304
    <88a>   DW_AT_decl_column : 1
    <88b>   DW_AT_sibling     : <0x8a2>
 <2><88f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <890>   DW_AT_name        : (indirect string, offset: 0x30780): HAL_TIM_CHANNEL_STATE_RESET
    <894>   DW_AT_const_value : 0
 <2><895>: Abbrev Number: 16 (DW_TAG_enumerator)
    <896>   DW_AT_name        : (indirect string, offset: 0x4fecf): HAL_TIM_CHANNEL_STATE_READY
    <89a>   DW_AT_const_value : 1
 <2><89b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <89c>   DW_AT_name        : (indirect string, offset: 0x41fa4): HAL_TIM_CHANNEL_STATE_BUSY
    <8a0>   DW_AT_const_value : 2
 <2><8a1>: Abbrev Number: 0
 <1><8a2>: Abbrev Number: 14 (DW_TAG_typedef)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x1c577): HAL_TIM_ChannelStateTypeDef
    <8a7>   DW_AT_decl_file   : 12
    <8a8>   DW_AT_decl_line   : 308
    <8aa>   DW_AT_decl_column : 3
    <8ab>   DW_AT_type        : <0x880>
 <1><8af>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8b0>   DW_AT_type        : <0x8a2>
 <1><8b4>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <8b5>   DW_AT_encoding    : 7	(unsigned)
    <8b6>   DW_AT_byte_size   : 1
    <8b7>   DW_AT_type        : <0x3c>
    <8bb>   DW_AT_decl_file   : 12
    <8bc>   DW_AT_decl_line   : 314
    <8be>   DW_AT_decl_column : 1
    <8bf>   DW_AT_sibling     : <0x8d6>
 <2><8c3>: Abbrev Number: 16 (DW_TAG_enumerator)
    <8c4>   DW_AT_name        : (indirect string, offset: 0x2cb0): HAL_DMA_BURST_STATE_RESET
    <8c8>   DW_AT_const_value : 0
 <2><8c9>: Abbrev Number: 16 (DW_TAG_enumerator)
    <8ca>   DW_AT_name        : (indirect string, offset: 0x4b213): HAL_DMA_BURST_STATE_READY
    <8ce>   DW_AT_const_value : 1
 <2><8cf>: Abbrev Number: 16 (DW_TAG_enumerator)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x6649f): HAL_DMA_BURST_STATE_BUSY
    <8d4>   DW_AT_const_value : 2
 <2><8d5>: Abbrev Number: 0
 <1><8d6>: Abbrev Number: 14 (DW_TAG_typedef)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x12337): HAL_TIM_DMABurstStateTypeDef
    <8db>   DW_AT_decl_file   : 12
    <8dc>   DW_AT_decl_line   : 318
    <8de>   DW_AT_decl_column : 3
    <8df>   DW_AT_type        : <0x8b4>
 <1><8e3>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8e4>   DW_AT_type        : <0x8d6>
 <1><8e8>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <8e9>   DW_AT_encoding    : 7	(unsigned)
    <8ea>   DW_AT_byte_size   : 1
    <8eb>   DW_AT_type        : <0x3c>
    <8ef>   DW_AT_decl_file   : 12
    <8f0>   DW_AT_decl_line   : 324
    <8f2>   DW_AT_decl_column : 1
    <8f3>   DW_AT_sibling     : <0x916>
 <2><8f7>: Abbrev Number: 16 (DW_TAG_enumerator)
    <8f8>   DW_AT_name        : (indirect string, offset: 0x4c763): HAL_TIM_ACTIVE_CHANNEL_1
    <8fc>   DW_AT_const_value : 1
 <2><8fd>: Abbrev Number: 16 (DW_TAG_enumerator)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x4c77c): HAL_TIM_ACTIVE_CHANNEL_2
    <902>   DW_AT_const_value : 2
 <2><903>: Abbrev Number: 16 (DW_TAG_enumerator)
    <904>   DW_AT_name        : (indirect string, offset: 0x4c795): HAL_TIM_ACTIVE_CHANNEL_3
    <908>   DW_AT_const_value : 4
 <2><909>: Abbrev Number: 16 (DW_TAG_enumerator)
    <90a>   DW_AT_name        : (indirect string, offset: 0x4c7ae): HAL_TIM_ACTIVE_CHANNEL_4
    <90e>   DW_AT_const_value : 8
 <2><90f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <910>   DW_AT_name        : (indirect string, offset: 0x38773): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <914>   DW_AT_const_value : 0
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 14 (DW_TAG_typedef)
    <917>   DW_AT_name        : (indirect string, offset: 0x1b6f1): HAL_TIM_ActiveChannel
    <91b>   DW_AT_decl_file   : 12
    <91c>   DW_AT_decl_line   : 330
    <91e>   DW_AT_decl_column : 3
    <91f>   DW_AT_type        : <0x8e8>
 <1><923>: Abbrev Number: 11 (DW_TAG_structure_type)
    <924>   DW_AT_byte_size   : 72
    <925>   DW_AT_decl_file   : 12
    <926>   DW_AT_decl_line   : 338
    <928>   DW_AT_decl_column : 9
    <929>   DW_AT_sibling     : <0x9ac>
 <2><92d>: Abbrev Number: 13 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x353d7): Instance
    <932>   DW_AT_decl_file   : 12
    <933>   DW_AT_decl_line   : 341
    <935>   DW_AT_decl_column : 39
    <936>   DW_AT_type        : <0x9ac>
    <93a>   DW_AT_data_member_location: 0
 <2><93b>: Abbrev Number: 13 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0x10088): Init
    <940>   DW_AT_decl_file   : 12
    <941>   DW_AT_decl_line   : 342
    <943>   DW_AT_decl_column : 38
    <944>   DW_AT_type        : <0x760>
    <948>   DW_AT_data_member_location: 4
 <2><949>: Abbrev Number: 13 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x1b6ff): Channel
    <94e>   DW_AT_decl_file   : 12
    <94f>   DW_AT_decl_line   : 343
    <951>   DW_AT_decl_column : 38
    <952>   DW_AT_type        : <0x916>
    <956>   DW_AT_data_member_location: 28
 <2><957>: Abbrev Number: 13 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x51c48): hdma
    <95c>   DW_AT_decl_file   : 12
    <95d>   DW_AT_decl_line   : 344
    <95f>   DW_AT_decl_column : 39
    <960>   DW_AT_type        : <0x9b2>
    <964>   DW_AT_data_member_location: 32
 <2><965>: Abbrev Number: 13 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0x61306): Lock
    <96a>   DW_AT_decl_file   : 12
    <96b>   DW_AT_decl_line   : 346
    <96d>   DW_AT_decl_column : 38
    <96e>   DW_AT_type        : <0x462>
    <972>   DW_AT_data_member_location: 60
 <2><973>: Abbrev Number: 13 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x5c5fe): State
    <978>   DW_AT_decl_file   : 12
    <979>   DW_AT_decl_line   : 347
    <97b>   DW_AT_decl_column : 38
    <97c>   DW_AT_type        : <0x87b>
    <980>   DW_AT_data_member_location: 61
 <2><981>: Abbrev Number: 13 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x8968d): ChannelState
    <986>   DW_AT_decl_file   : 12
    <987>   DW_AT_decl_line   : 348
    <989>   DW_AT_decl_column : 38
    <98a>   DW_AT_type        : <0x9d8>
    <98e>   DW_AT_data_member_location: 62
 <2><98f>: Abbrev Number: 13 (DW_TAG_member)
    <990>   DW_AT_name        : (indirect string, offset: 0x89c14): ChannelNState
    <994>   DW_AT_decl_file   : 12
    <995>   DW_AT_decl_line   : 349
    <997>   DW_AT_decl_column : 38
    <998>   DW_AT_type        : <0x9d8>
    <99c>   DW_AT_data_member_location: 66
 <2><99d>: Abbrev Number: 13 (DW_TAG_member)
    <99e>   DW_AT_name        : (indirect string, offset: 0x89242): DMABurstState
    <9a2>   DW_AT_decl_file   : 12
    <9a3>   DW_AT_decl_line   : 350
    <9a5>   DW_AT_decl_column : 38
    <9a6>   DW_AT_type        : <0x8e3>
    <9aa>   DW_AT_data_member_location: 70
 <2><9ab>: Abbrev Number: 0
 <1><9ac>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <9ad>   DW_AT_byte_size   : 4
    <9ae>   DW_AT_type        : <0x394>
 <1><9b2>: Abbrev Number: 9 (DW_TAG_array_type)
    <9b3>   DW_AT_type        : <0x9c2>
    <9b7>   DW_AT_sibling     : <0x9c2>
 <2><9bb>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9bc>   DW_AT_type        : <0x98>
    <9c0>   DW_AT_upper_bound : 6
 <2><9c1>: Abbrev Number: 0
 <1><9c2>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <9c3>   DW_AT_byte_size   : 4
    <9c4>   DW_AT_type        : <0x6fc>
 <1><9c8>: Abbrev Number: 9 (DW_TAG_array_type)
    <9c9>   DW_AT_type        : <0x8af>
    <9cd>   DW_AT_sibling     : <0x9d8>
 <2><9d1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9d2>   DW_AT_type        : <0x98>
    <9d6>   DW_AT_upper_bound : 3
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <9d9>   DW_AT_type        : <0x9c8>
 <1><9dd>: Abbrev Number: 14 (DW_TAG_typedef)
    <9de>   DW_AT_name        : (indirect string, offset: 0x2ee9b): TIM_HandleTypeDef
    <9e2>   DW_AT_decl_file   : 12
    <9e3>   DW_AT_decl_line   : 381
    <9e5>   DW_AT_decl_column : 3
    <9e6>   DW_AT_type        : <0x923>
 <1><9ea>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9eb>   DW_AT_byte_size   : 28
    <9ec>   DW_AT_decl_file   : 13
    <9ed>   DW_AT_decl_line   : 47
    <9ee>   DW_AT_decl_column : 9
    <9ef>   DW_AT_sibling     : <0xa4f>
 <2><9f3>: Abbrev Number: 18 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x7bd00): BaudRate
    <9f8>   DW_AT_decl_file   : 13
    <9f9>   DW_AT_decl_line   : 49
    <9fa>   DW_AT_decl_column : 12
    <9fb>   DW_AT_type        : <0xd2>
    <9ff>   DW_AT_data_member_location: 0
 <2><a00>: Abbrev Number: 18 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x408e): WordLength
    <a05>   DW_AT_decl_file   : 13
    <a06>   DW_AT_decl_line   : 54
    <a07>   DW_AT_decl_column : 12
    <a08>   DW_AT_type        : <0xd2>
    <a0c>   DW_AT_data_member_location: 4
 <2><a0d>: Abbrev Number: 18 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0x7bf94): StopBits
    <a12>   DW_AT_decl_file   : 13
    <a13>   DW_AT_decl_line   : 57
    <a14>   DW_AT_decl_column : 12
    <a15>   DW_AT_type        : <0xd2>
    <a19>   DW_AT_data_member_location: 8
 <2><a1a>: Abbrev Number: 18 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0x310fe): Parity
    <a1f>   DW_AT_decl_file   : 13
    <a20>   DW_AT_decl_line   : 60
    <a21>   DW_AT_decl_column : 12
    <a22>   DW_AT_type        : <0xd2>
    <a26>   DW_AT_data_member_location: 12
 <2><a27>: Abbrev Number: 18 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0x89095): Mode
    <a2c>   DW_AT_decl_file   : 13
    <a2d>   DW_AT_decl_line   : 67
    <a2e>   DW_AT_decl_column : 12
    <a2f>   DW_AT_type        : <0xd2>
    <a33>   DW_AT_data_member_location: 16
 <2><a34>: Abbrev Number: 18 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0x100b4): HwFlowCtl
    <a39>   DW_AT_decl_file   : 13
    <a3a>   DW_AT_decl_line   : 70
    <a3b>   DW_AT_decl_column : 12
    <a3c>   DW_AT_type        : <0xd2>
    <a40>   DW_AT_data_member_location: 20
 <2><a41>: Abbrev Number: 18 (DW_TAG_member)
    <a42>   DW_AT_name        : (indirect string, offset: 0x72248): OverSampling
    <a46>   DW_AT_decl_file   : 13
    <a47>   DW_AT_decl_line   : 73
    <a48>   DW_AT_decl_column : 12
    <a49>   DW_AT_type        : <0xd2>
    <a4d>   DW_AT_data_member_location: 24
 <2><a4e>: Abbrev Number: 0
 <1><a4f>: Abbrev Number: 3 (DW_TAG_typedef)
    <a50>   DW_AT_name        : (indirect string, offset: 0x265f0): UART_InitTypeDef
    <a54>   DW_AT_decl_file   : 13
    <a55>   DW_AT_decl_line   : 76
    <a56>   DW_AT_decl_column : 3
    <a57>   DW_AT_type        : <0x9ea>
 <1><a5b>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <a5c>   DW_AT_encoding    : 7	(unsigned)
    <a5d>   DW_AT_byte_size   : 1
    <a5e>   DW_AT_type        : <0x3c>
    <a62>   DW_AT_decl_file   : 13
    <a63>   DW_AT_decl_line   : 118
    <a64>   DW_AT_decl_column : 1
    <a65>   DW_AT_sibling     : <0xa9a>
 <2><a69>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x3a40c): HAL_UART_STATE_RESET
    <a6e>   DW_AT_const_value : 0
 <2><a6f>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0xfcbb): HAL_UART_STATE_READY
    <a74>   DW_AT_const_value : 32
 <2><a75>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x78199): HAL_UART_STATE_BUSY
    <a7a>   DW_AT_const_value : 36
 <2><a7b>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x1acb): HAL_UART_STATE_BUSY_TX
    <a80>   DW_AT_const_value : 33
 <2><a81>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x10d9): HAL_UART_STATE_BUSY_RX
    <a86>   DW_AT_const_value : 34
 <2><a87>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x1e6b7): HAL_UART_STATE_BUSY_TX_RX
    <a8c>   DW_AT_const_value : 35
 <2><a8d>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x4272a): HAL_UART_STATE_TIMEOUT
    <a92>   DW_AT_const_value : 160
 <2><a93>: Abbrev Number: 16 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x5f1c5): HAL_UART_STATE_ERROR
    <a98>   DW_AT_const_value : 224
 <2><a99>: Abbrev Number: 0
 <1><a9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x29f8e): HAL_UART_StateTypeDef
    <a9f>   DW_AT_decl_file   : 13
    <aa0>   DW_AT_decl_line   : 136
    <aa1>   DW_AT_decl_column : 3
    <aa2>   DW_AT_type        : <0xa5b>
 <1><aa6>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <aa7>   DW_AT_type        : <0xa9a>
 <1><aab>: Abbrev Number: 3 (DW_TAG_typedef)
    <aac>   DW_AT_name        : (indirect string, offset: 0x3812d): HAL_UART_RxTypeTypeDef
    <ab0>   DW_AT_decl_file   : 13
    <ab1>   DW_AT_decl_line   : 145
    <ab2>   DW_AT_decl_column : 18
    <ab3>   DW_AT_type        : <0xd2>
 <1><ab7>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <ab8>   DW_AT_type        : <0xaab>
 <1><abc>: Abbrev Number: 21 (DW_TAG_structure_type)
    <abd>   DW_AT_name        : (indirect string, offset: 0x4ed88): __UART_HandleTypeDef
    <ac1>   DW_AT_byte_size   : 68
    <ac2>   DW_AT_decl_file   : 13
    <ac3>   DW_AT_decl_line   : 150
    <ac4>   DW_AT_decl_column : 16
    <ac5>   DW_AT_sibling     : <0xb8d>
 <2><ac9>: Abbrev Number: 18 (DW_TAG_member)
    <aca>   DW_AT_name        : (indirect string, offset: 0x353d7): Instance
    <ace>   DW_AT_decl_file   : 13
    <acf>   DW_AT_decl_line   : 152
    <ad0>   DW_AT_decl_column : 34
    <ad1>   DW_AT_type        : <0xb8d>
    <ad5>   DW_AT_data_member_location: 0
 <2><ad6>: Abbrev Number: 18 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x10088): Init
    <adb>   DW_AT_decl_file   : 13
    <adc>   DW_AT_decl_line   : 154
    <add>   DW_AT_decl_column : 33
    <ade>   DW_AT_type        : <0xa4f>
    <ae2>   DW_AT_data_member_location: 4
 <2><ae3>: Abbrev Number: 18 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x41924): pTxBuffPtr
    <ae8>   DW_AT_decl_file   : 13
    <ae9>   DW_AT_decl_line   : 156
    <aea>   DW_AT_decl_column : 34
    <aeb>   DW_AT_type        : <0xb93>
    <aef>   DW_AT_data_member_location: 32
 <2><af0>: Abbrev Number: 18 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0x39eb9): TxXferSize
    <af5>   DW_AT_decl_file   : 13
    <af6>   DW_AT_decl_line   : 158
    <af7>   DW_AT_decl_column : 33
    <af8>   DW_AT_type        : <0xb0>
    <afc>   DW_AT_data_member_location: 36
 <2><afd>: Abbrev Number: 18 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x425e8): TxXferCount
    <b02>   DW_AT_decl_file   : 13
    <b03>   DW_AT_decl_line   : 160
    <b04>   DW_AT_decl_column : 33
    <b05>   DW_AT_type        : <0xbc>
    <b09>   DW_AT_data_member_location: 38
 <2><b0a>: Abbrev Number: 18 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x7d95a): pRxBuffPtr
    <b0f>   DW_AT_decl_file   : 13
    <b10>   DW_AT_decl_line   : 162
    <b11>   DW_AT_decl_column : 34
    <b12>   DW_AT_type        : <0xb93>
    <b16>   DW_AT_data_member_location: 40
 <2><b17>: Abbrev Number: 18 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x410a1): RxXferSize
    <b1c>   DW_AT_decl_file   : 13
    <b1d>   DW_AT_decl_line   : 164
    <b1e>   DW_AT_decl_column : 33
    <b1f>   DW_AT_type        : <0xb0>
    <b23>   DW_AT_data_member_location: 44
 <2><b24>: Abbrev Number: 18 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x51dc4): RxXferCount
    <b29>   DW_AT_decl_file   : 13
    <b2a>   DW_AT_decl_line   : 166
    <b2b>   DW_AT_decl_column : 33
    <b2c>   DW_AT_type        : <0xbc>
    <b30>   DW_AT_data_member_location: 46
 <2><b31>: Abbrev Number: 18 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0x719fc): ReceptionType
    <b36>   DW_AT_decl_file   : 13
    <b37>   DW_AT_decl_line   : 168
    <b38>   DW_AT_decl_column : 31
    <b39>   DW_AT_type        : <0xab7>
    <b3d>   DW_AT_data_member_location: 48
 <2><b3e>: Abbrev Number: 18 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0x83617): hdmatx
    <b43>   DW_AT_decl_file   : 13
    <b44>   DW_AT_decl_line   : 170
    <b45>   DW_AT_decl_column : 34
    <b46>   DW_AT_type        : <0x9c2>
    <b4a>   DW_AT_data_member_location: 52
 <2><b4b>: Abbrev Number: 18 (DW_TAG_member)
    <b4c>   DW_AT_name        : (indirect string, offset: 0x82d3c): hdmarx
    <b50>   DW_AT_decl_file   : 13
    <b51>   DW_AT_decl_line   : 172
    <b52>   DW_AT_decl_column : 34
    <b53>   DW_AT_type        : <0x9c2>
    <b57>   DW_AT_data_member_location: 56
 <2><b58>: Abbrev Number: 18 (DW_TAG_member)
    <b59>   DW_AT_name        : (indirect string, offset: 0x61306): Lock
    <b5d>   DW_AT_decl_file   : 13
    <b5e>   DW_AT_decl_line   : 174
    <b5f>   DW_AT_decl_column : 33
    <b60>   DW_AT_type        : <0x462>
    <b64>   DW_AT_data_member_location: 60
 <2><b65>: Abbrev Number: 18 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0x37af5): gState
    <b6a>   DW_AT_decl_file   : 13
    <b6b>   DW_AT_decl_line   : 176
    <b6c>   DW_AT_decl_column : 33
    <b6d>   DW_AT_type        : <0xaa6>
    <b71>   DW_AT_data_member_location: 61
 <2><b72>: Abbrev Number: 18 (DW_TAG_member)
    <b73>   DW_AT_name        : (indirect string, offset: 0x7a08d): RxState
    <b77>   DW_AT_decl_file   : 13
    <b78>   DW_AT_decl_line   : 180
    <b79>   DW_AT_decl_column : 33
    <b7a>   DW_AT_type        : <0xaa6>
    <b7e>   DW_AT_data_member_location: 62
 <2><b7f>: Abbrev Number: 18 (DW_TAG_member)
    <b80>   DW_AT_name        : (indirect string, offset: 0x83eb3): ErrorCode
    <b84>   DW_AT_decl_file   : 13
    <b85>   DW_AT_decl_line   : 183
    <b86>   DW_AT_decl_column : 33
    <b87>   DW_AT_type        : <0xde>
    <b8b>   DW_AT_data_member_location: 64
 <2><b8c>: Abbrev Number: 0
 <1><b8d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <b8e>   DW_AT_byte_size   : 4
    <b8f>   DW_AT_type        : <0x40c>
 <1><b93>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <b94>   DW_AT_byte_size   : 4
    <b95>   DW_AT_type        : <0x9f>
 <1><b99>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9a>   DW_AT_name        : (indirect string, offset: 0x4ed8a): UART_HandleTypeDef
    <b9e>   DW_AT_decl_file   : 13
    <b9f>   DW_AT_decl_line   : 201
    <ba0>   DW_AT_decl_column : 3
    <ba1>   DW_AT_type        : <0xabc>
 <1><ba5>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <ba6>   DW_AT_encoding    : 7	(unsigned)
    <ba7>   DW_AT_byte_size   : 1
    <ba8>   DW_AT_type        : <0x3c>
    <bac>   DW_AT_decl_file   : 14
    <bad>   DW_AT_decl_line   : 50
    <bae>   DW_AT_decl_column : 1
    <baf>   DW_AT_sibling     : <0xbcc>
 <2><bb3>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x45f42): HAL_TICK_FREQ_10HZ
    <bb8>   DW_AT_const_value : 100
 <2><bb9>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0x3282e): HAL_TICK_FREQ_100HZ
    <bbe>   DW_AT_const_value : 10
 <2><bbf>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0x3febc): HAL_TICK_FREQ_1KHZ
    <bc4>   DW_AT_const_value : 1
 <2><bc5>: Abbrev Number: 16 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x310b0): HAL_TICK_FREQ_DEFAULT
    <bca>   DW_AT_const_value : 1
 <2><bcb>: Abbrev Number: 0
 <1><bcc>: Abbrev Number: 3 (DW_TAG_typedef)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x6b433): HAL_TickFreqTypeDef
    <bd1>   DW_AT_decl_file   : 14
    <bd2>   DW_AT_decl_line   : 55
    <bd3>   DW_AT_decl_column : 3
    <bd4>   DW_AT_type        : <0xba5>
 <1><bd8>: Abbrev Number: 8 (DW_TAG_variable)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x63f23): uwTick
    <bdd>   DW_AT_decl_file   : 14
    <bde>   DW_AT_decl_line   : 60
    <bdf>   DW_AT_decl_column : 22
    <be0>   DW_AT_type        : <0xde>
    <be4>   DW_AT_external    : 1
    <be4>   DW_AT_declaration : 1
 <1><be4>: Abbrev Number: 8 (DW_TAG_variable)
    <be5>   DW_AT_name        : (indirect string, offset: 0x66313): uwTickPrio
    <be9>   DW_AT_decl_file   : 14
    <bea>   DW_AT_decl_line   : 61
    <beb>   DW_AT_decl_column : 17
    <bec>   DW_AT_type        : <0xd2>
    <bf0>   DW_AT_external    : 1
    <bf0>   DW_AT_declaration : 1
 <1><bf0>: Abbrev Number: 8 (DW_TAG_variable)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x7a7ba): uwTickFreq
    <bf5>   DW_AT_decl_file   : 14
    <bf6>   DW_AT_decl_line   : 62
    <bf7>   DW_AT_decl_column : 28
    <bf8>   DW_AT_type        : <0xbcc>
    <bfc>   DW_AT_external    : 1
    <bfc>   DW_AT_declaration : 1
 <1><bfc>: Abbrev Number: 14 (DW_TAG_typedef)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x86e88): wint_t
    <c01>   DW_AT_decl_file   : 15
    <c02>   DW_AT_decl_line   : 350
    <c04>   DW_AT_decl_column : 23
    <c05>   DW_AT_type        : <0x98>
 <1><c09>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x3fa78): _off_t
    <c0e>   DW_AT_decl_file   : 16
    <c0f>   DW_AT_decl_line   : 46
    <c10>   DW_AT_decl_column : 14
    <c11>   DW_AT_type        : <0x69>
 <1><c15>: Abbrev Number: 3 (DW_TAG_typedef)
    <c16>   DW_AT_name        : (indirect string, offset: 0x1e17a): _fpos_t
    <c1a>   DW_AT_decl_file   : 16
    <c1b>   DW_AT_decl_line   : 116
    <c1c>   DW_AT_decl_column : 14
    <c1d>   DW_AT_type        : <0x69>
 <1><c21>: Abbrev Number: 26 (DW_TAG_union_type)
    <c22>   DW_AT_byte_size   : 4
    <c23>   DW_AT_decl_file   : 16
    <c24>   DW_AT_decl_line   : 165
    <c25>   DW_AT_decl_column : 3
    <c26>   DW_AT_sibling     : <0xc43>
 <2><c2a>: Abbrev Number: 27 (DW_TAG_member)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x7f649): __wch
    <c2f>   DW_AT_decl_file   : 16
    <c30>   DW_AT_decl_line   : 167
    <c31>   DW_AT_decl_column : 12
    <c32>   DW_AT_type        : <0xbfc>
 <2><c36>: Abbrev Number: 27 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0x46328): __wchb
    <c3b>   DW_AT_decl_file   : 16
    <c3c>   DW_AT_decl_line   : 168
    <c3d>   DW_AT_decl_column : 19
    <c3e>   DW_AT_type        : <0xc43>
 <2><c42>: Abbrev Number: 0
 <1><c43>: Abbrev Number: 9 (DW_TAG_array_type)
    <c44>   DW_AT_type        : <0x3c>
    <c48>   DW_AT_sibling     : <0xc53>
 <2><c4c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <c4d>   DW_AT_type        : <0x98>
    <c51>   DW_AT_upper_bound : 3
 <2><c52>: Abbrev Number: 0
 <1><c53>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c54>   DW_AT_byte_size   : 8
    <c55>   DW_AT_decl_file   : 16
    <c56>   DW_AT_decl_line   : 162
    <c57>   DW_AT_decl_column : 9
    <c58>   DW_AT_sibling     : <0xc77>
 <2><c5c>: Abbrev Number: 18 (DW_TAG_member)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x26669): __count
    <c61>   DW_AT_decl_file   : 16
    <c62>   DW_AT_decl_line   : 164
    <c63>   DW_AT_decl_column : 7
    <c64>   DW_AT_type        : <0x91>
    <c68>   DW_AT_data_member_location: 0
 <2><c69>: Abbrev Number: 18 (DW_TAG_member)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x1b939): __value
    <c6e>   DW_AT_decl_file   : 16
    <c6f>   DW_AT_decl_line   : 169
    <c70>   DW_AT_decl_column : 5
    <c71>   DW_AT_type        : <0xc21>
    <c75>   DW_AT_data_member_location: 4
 <2><c76>: Abbrev Number: 0
 <1><c77>: Abbrev Number: 3 (DW_TAG_typedef)
    <c78>   DW_AT_name        : (indirect string, offset: 0x47602): _mbstate_t
    <c7c>   DW_AT_decl_file   : 16
    <c7d>   DW_AT_decl_line   : 170
    <c7e>   DW_AT_decl_column : 3
    <c7f>   DW_AT_type        : <0xc53>
 <1><c83>: Abbrev Number: 3 (DW_TAG_typedef)
    <c84>   DW_AT_name        : (indirect string, offset: 0x78f51): __ULong
    <c88>   DW_AT_decl_file   : 17
    <c89>   DW_AT_decl_line   : 22
    <c8a>   DW_AT_decl_column : 25
    <c8b>   DW_AT_type        : <0x7c>
 <1><c8f>: Abbrev Number: 3 (DW_TAG_typedef)
    <c90>   DW_AT_name        : (indirect string, offset: 0x4b64f): _LOCK_T
    <c94>   DW_AT_decl_file   : 18
    <c95>   DW_AT_decl_line   : 34
    <c96>   DW_AT_decl_column : 25
    <c97>   DW_AT_type        : <0xc9b>
 <1><c9b>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <c9c>   DW_AT_byte_size   : 4
    <c9d>   DW_AT_type        : <0xca1>
 <1><ca1>: Abbrev Number: 28 (DW_TAG_structure_type)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x111d3): __lock
    <ca6>   DW_AT_declaration : 1
 <1><ca6>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x435b5): _flock_t
    <cab>   DW_AT_decl_file   : 17
    <cac>   DW_AT_decl_line   : 35
    <cad>   DW_AT_decl_column : 27
    <cae>   DW_AT_type        : <0xc8f>
 <1><cb2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x2ee2a): _Bigint
    <cb7>   DW_AT_byte_size   : 24
    <cb8>   DW_AT_decl_file   : 17
    <cb9>   DW_AT_decl_line   : 52
    <cba>   DW_AT_decl_column : 8
    <cbb>   DW_AT_sibling     : <0xd0c>
 <2><cbf>: Abbrev Number: 18 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x50e24): _next
    <cc4>   DW_AT_decl_file   : 17
    <cc5>   DW_AT_decl_line   : 54
    <cc6>   DW_AT_decl_column : 19
    <cc7>   DW_AT_type        : <0xd0c>
    <ccb>   DW_AT_data_member_location: 0
 <2><ccc>: Abbrev Number: 29 (DW_TAG_member)
    <ccd>   DW_AT_name        : _k
    <cd0>   DW_AT_decl_file   : 17
    <cd1>   DW_AT_decl_line   : 55
    <cd2>   DW_AT_decl_column : 7
    <cd3>   DW_AT_type        : <0x91>
    <cd7>   DW_AT_data_member_location: 4
 <2><cd8>: Abbrev Number: 18 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x61a72): _maxwds
    <cdd>   DW_AT_decl_file   : 17
    <cde>   DW_AT_decl_line   : 55
    <cdf>   DW_AT_decl_column : 11
    <ce0>   DW_AT_type        : <0x91>
    <ce4>   DW_AT_data_member_location: 8
 <2><ce5>: Abbrev Number: 18 (DW_TAG_member)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x4892c): _sign
    <cea>   DW_AT_decl_file   : 17
    <ceb>   DW_AT_decl_line   : 55
    <cec>   DW_AT_decl_column : 20
    <ced>   DW_AT_type        : <0x91>
    <cf1>   DW_AT_data_member_location: 12
 <2><cf2>: Abbrev Number: 18 (DW_TAG_member)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x487bc): _wds
    <cf7>   DW_AT_decl_file   : 17
    <cf8>   DW_AT_decl_line   : 55
    <cf9>   DW_AT_decl_column : 27
    <cfa>   DW_AT_type        : <0x91>
    <cfe>   DW_AT_data_member_location: 16
 <2><cff>: Abbrev Number: 29 (DW_TAG_member)
    <d00>   DW_AT_name        : _x
    <d03>   DW_AT_decl_file   : 17
    <d04>   DW_AT_decl_line   : 56
    <d05>   DW_AT_decl_column : 11
    <d06>   DW_AT_type        : <0xd12>
    <d0a>   DW_AT_data_member_location: 20
 <2><d0b>: Abbrev Number: 0
 <1><d0c>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <d0d>   DW_AT_byte_size   : 4
    <d0e>   DW_AT_type        : <0xcb2>
 <1><d12>: Abbrev Number: 9 (DW_TAG_array_type)
    <d13>   DW_AT_type        : <0xc83>
    <d17>   DW_AT_sibling     : <0xd22>
 <2><d1b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <d1c>   DW_AT_type        : <0x98>
    <d20>   DW_AT_upper_bound : 0
 <2><d21>: Abbrev Number: 0
 <1><d22>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d23>   DW_AT_name        : (indirect string, offset: 0x2521b): __tm
    <d27>   DW_AT_byte_size   : 36
    <d28>   DW_AT_decl_file   : 17
    <d29>   DW_AT_decl_line   : 60
    <d2a>   DW_AT_decl_column : 8
    <d2b>   DW_AT_sibling     : <0xda5>
 <2><d2f>: Abbrev Number: 18 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x6f6e9): __tm_sec
    <d34>   DW_AT_decl_file   : 17
    <d35>   DW_AT_decl_line   : 62
    <d36>   DW_AT_decl_column : 9
    <d37>   DW_AT_type        : <0x91>
    <d3b>   DW_AT_data_member_location: 0
 <2><d3c>: Abbrev Number: 18 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x980): __tm_min
    <d41>   DW_AT_decl_file   : 17
    <d42>   DW_AT_decl_line   : 63
    <d43>   DW_AT_decl_column : 9
    <d44>   DW_AT_type        : <0x91>
    <d48>   DW_AT_data_member_location: 4
 <2><d49>: Abbrev Number: 18 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x1ce8e): __tm_hour
    <d4e>   DW_AT_decl_file   : 17
    <d4f>   DW_AT_decl_line   : 64
    <d50>   DW_AT_decl_column : 9
    <d51>   DW_AT_type        : <0x91>
    <d55>   DW_AT_data_member_location: 8
 <2><d56>: Abbrev Number: 18 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x4fa27): __tm_mday
    <d5b>   DW_AT_decl_file   : 17
    <d5c>   DW_AT_decl_line   : 65
    <d5d>   DW_AT_decl_column : 9
    <d5e>   DW_AT_type        : <0x91>
    <d62>   DW_AT_data_member_location: 12
 <2><d63>: Abbrev Number: 18 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0x25e6): __tm_mon
    <d68>   DW_AT_decl_file   : 17
    <d69>   DW_AT_decl_line   : 66
    <d6a>   DW_AT_decl_column : 9
    <d6b>   DW_AT_type        : <0x91>
    <d6f>   DW_AT_data_member_location: 16
 <2><d70>: Abbrev Number: 18 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0x7dc68): __tm_year
    <d75>   DW_AT_decl_file   : 17
    <d76>   DW_AT_decl_line   : 67
    <d77>   DW_AT_decl_column : 9
    <d78>   DW_AT_type        : <0x91>
    <d7c>   DW_AT_data_member_location: 20
 <2><d7d>: Abbrev Number: 18 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x3a15b): __tm_wday
    <d82>   DW_AT_decl_file   : 17
    <d83>   DW_AT_decl_line   : 68
    <d84>   DW_AT_decl_column : 9
    <d85>   DW_AT_type        : <0x91>
    <d89>   DW_AT_data_member_location: 24
 <2><d8a>: Abbrev Number: 18 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x74867): __tm_yday
    <d8f>   DW_AT_decl_file   : 17
    <d90>   DW_AT_decl_line   : 69
    <d91>   DW_AT_decl_column : 9
    <d92>   DW_AT_type        : <0x91>
    <d96>   DW_AT_data_member_location: 28
 <2><d97>: Abbrev Number: 18 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x79e71): __tm_isdst
    <d9c>   DW_AT_decl_file   : 17
    <d9d>   DW_AT_decl_line   : 70
    <d9e>   DW_AT_decl_column : 9
    <d9f>   DW_AT_type        : <0x91>
    <da3>   DW_AT_data_member_location: 32
 <2><da4>: Abbrev Number: 0
 <1><da5>: Abbrev Number: 30 (DW_TAG_structure_type)
    <da6>   DW_AT_name        : (indirect string, offset: 0x6e36f): _on_exit_args
    <daa>   DW_AT_byte_size   : 264
    <dac>   DW_AT_decl_file   : 17
    <dad>   DW_AT_decl_line   : 79
    <dae>   DW_AT_decl_column : 8
    <daf>   DW_AT_sibling     : <0xdea>
 <2><db3>: Abbrev Number: 18 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x78929): _fnargs
    <db8>   DW_AT_decl_file   : 17
    <db9>   DW_AT_decl_line   : 80
    <dba>   DW_AT_decl_column : 10
    <dbb>   DW_AT_type        : <0xdea>
    <dbf>   DW_AT_data_member_location: 0
 <2><dc0>: Abbrev Number: 18 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x71a96): _dso_handle
    <dc5>   DW_AT_decl_file   : 17
    <dc6>   DW_AT_decl_line   : 81
    <dc7>   DW_AT_decl_column : 9
    <dc8>   DW_AT_type        : <0xdea>
    <dcc>   DW_AT_data_member_location: 128
 <2><dcd>: Abbrev Number: 31 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0x5f535): _fntypes
    <dd2>   DW_AT_decl_file   : 17
    <dd3>   DW_AT_decl_line   : 83
    <dd4>   DW_AT_decl_column : 10
    <dd5>   DW_AT_type        : <0xc83>
    <dd9>   DW_AT_data_member_location: 256
 <2><ddb>: Abbrev Number: 31 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x38741): _is_cxa
    <de0>   DW_AT_decl_file   : 17
    <de1>   DW_AT_decl_line   : 86
    <de2>   DW_AT_decl_column : 10
    <de3>   DW_AT_type        : <0xc83>
    <de7>   DW_AT_data_member_location: 260
 <2><de9>: Abbrev Number: 0
 <1><dea>: Abbrev Number: 9 (DW_TAG_array_type)
    <deb>   DW_AT_type        : <0x6dd>
    <def>   DW_AT_sibling     : <0xdfa>
 <2><df3>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <df4>   DW_AT_type        : <0x98>
    <df8>   DW_AT_upper_bound : 31
 <2><df9>: Abbrev Number: 0
 <1><dfa>: Abbrev Number: 21 (DW_TAG_structure_type)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x2832): _atexit
    <dff>   DW_AT_byte_size   : 140
    <e00>   DW_AT_decl_file   : 17
    <e01>   DW_AT_decl_line   : 90
    <e02>   DW_AT_decl_column : 8
    <e03>   DW_AT_sibling     : <0xe3c>
 <2><e07>: Abbrev Number: 18 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x50e24): _next
    <e0c>   DW_AT_decl_file   : 17
    <e0d>   DW_AT_decl_line   : 91
    <e0e>   DW_AT_decl_column : 18
    <e0f>   DW_AT_type        : <0xe3c>
    <e13>   DW_AT_data_member_location: 0
 <2><e14>: Abbrev Number: 18 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0x5608a): _ind
    <e19>   DW_AT_decl_file   : 17
    <e1a>   DW_AT_decl_line   : 92
    <e1b>   DW_AT_decl_column : 6
    <e1c>   DW_AT_type        : <0x91>
    <e20>   DW_AT_data_member_location: 4
 <2><e21>: Abbrev Number: 18 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0x1df3a): _fns
    <e26>   DW_AT_decl_file   : 17
    <e27>   DW_AT_decl_line   : 93
    <e28>   DW_AT_decl_column : 9
    <e29>   DW_AT_type        : <0xe42>
    <e2d>   DW_AT_data_member_location: 8
 <2><e2e>: Abbrev Number: 18 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x6d816): _on_exit_args_ptr
    <e33>   DW_AT_decl_file   : 17
    <e34>   DW_AT_decl_line   : 94
    <e35>   DW_AT_decl_column : 32
    <e36>   DW_AT_type        : <0xe52>
    <e3a>   DW_AT_data_member_location: 136
 <2><e3b>: Abbrev Number: 0
 <1><e3c>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <e3d>   DW_AT_byte_size   : 4
    <e3e>   DW_AT_type        : <0xdfa>
 <1><e42>: Abbrev Number: 9 (DW_TAG_array_type)
    <e43>   DW_AT_type        : <0x583>
    <e47>   DW_AT_sibling     : <0xe52>
 <2><e4b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <e4c>   DW_AT_type        : <0x98>
    <e50>   DW_AT_upper_bound : 31
 <2><e51>: Abbrev Number: 0
 <1><e52>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <e53>   DW_AT_byte_size   : 4
    <e54>   DW_AT_type        : <0xda5>
 <1><e58>: Abbrev Number: 21 (DW_TAG_structure_type)
    <e59>   DW_AT_name        : (indirect string, offset: 0x5aea7): __sbuf
    <e5d>   DW_AT_byte_size   : 8
    <e5e>   DW_AT_decl_file   : 17
    <e5f>   DW_AT_decl_line   : 122
    <e60>   DW_AT_decl_column : 8
    <e61>   DW_AT_sibling     : <0xe80>
 <2><e65>: Abbrev Number: 18 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x860f5): _base
    <e6a>   DW_AT_decl_file   : 17
    <e6b>   DW_AT_decl_line   : 123
    <e6c>   DW_AT_decl_column : 17
    <e6d>   DW_AT_type        : <0xe80>
    <e71>   DW_AT_data_member_location: 0
 <2><e72>: Abbrev Number: 18 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x4da14): _size
    <e77>   DW_AT_decl_file   : 17
    <e78>   DW_AT_decl_line   : 124
    <e79>   DW_AT_decl_column : 6
    <e7a>   DW_AT_type        : <0x91>
    <e7e>   DW_AT_data_member_location: 4
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <e81>   DW_AT_byte_size   : 4
    <e82>   DW_AT_type        : <0x3c>
 <1><e86>: Abbrev Number: 21 (DW_TAG_structure_type)
    <e87>   DW_AT_name        : (indirect string, offset: 0x19402): __sFILE_fake
    <e8b>   DW_AT_byte_size   : 32
    <e8c>   DW_AT_decl_file   : 17
    <e8d>   DW_AT_decl_line   : 158
    <e8e>   DW_AT_decl_column : 8
    <e8f>   DW_AT_sibling     : <0xef9>
 <2><e93>: Abbrev Number: 29 (DW_TAG_member)
    <e94>   DW_AT_name        : _p
    <e97>   DW_AT_decl_file   : 17
    <e98>   DW_AT_decl_line   : 159
    <e99>   DW_AT_decl_column : 18
    <e9a>   DW_AT_type        : <0xe80>
    <e9e>   DW_AT_data_member_location: 0
 <2><e9f>: Abbrev Number: 29 (DW_TAG_member)
    <ea0>   DW_AT_name        : _r
    <ea3>   DW_AT_decl_file   : 17
    <ea4>   DW_AT_decl_line   : 160
    <ea5>   DW_AT_decl_column : 7
    <ea6>   DW_AT_type        : <0x91>
    <eaa>   DW_AT_data_member_location: 4
 <2><eab>: Abbrev Number: 29 (DW_TAG_member)
    <eac>   DW_AT_name        : _w
    <eaf>   DW_AT_decl_file   : 17
    <eb0>   DW_AT_decl_line   : 161
    <eb1>   DW_AT_decl_column : 7
    <eb2>   DW_AT_type        : <0x91>
    <eb6>   DW_AT_data_member_location: 8
 <2><eb7>: Abbrev Number: 18 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0x3eaf2): _flags
    <ebc>   DW_AT_decl_file   : 17
    <ebd>   DW_AT_decl_line   : 162
    <ebe>   DW_AT_decl_column : 9
    <ebf>   DW_AT_type        : <0x43>
    <ec3>   DW_AT_data_member_location: 12
 <2><ec4>: Abbrev Number: 18 (DW_TAG_member)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x14ae6): _file
    <ec9>   DW_AT_decl_file   : 17
    <eca>   DW_AT_decl_line   : 163
    <ecb>   DW_AT_decl_column : 9
    <ecc>   DW_AT_type        : <0x43>
    <ed0>   DW_AT_data_member_location: 14
 <2><ed1>: Abbrev Number: 29 (DW_TAG_member)
    <ed2>   DW_AT_name        : _bf
    <ed6>   DW_AT_decl_file   : 17
    <ed7>   DW_AT_decl_line   : 164
    <ed8>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0xe58>
    <edd>   DW_AT_data_member_location: 16
 <2><ede>: Abbrev Number: 18 (DW_TAG_member)
    <edf>   DW_AT_name        : (indirect string, offset: 0x3ef75): _lbfsize
    <ee3>   DW_AT_decl_file   : 17
    <ee4>   DW_AT_decl_line   : 165
    <ee5>   DW_AT_decl_column : 7
    <ee6>   DW_AT_type        : <0x91>
    <eea>   DW_AT_data_member_location: 24
 <2><eeb>: Abbrev Number: 18 (DW_TAG_member)
    <eec>   DW_AT_name        : (indirect string, offset: 0x8a27b): _data
    <ef0>   DW_AT_decl_file   : 17
    <ef1>   DW_AT_decl_line   : 167
    <ef2>   DW_AT_decl_column : 18
    <ef3>   DW_AT_type        : <0x1041>
    <ef7>   DW_AT_data_member_location: 28
 <2><ef8>: Abbrev Number: 0
 <1><ef9>: Abbrev Number: 5 (DW_TAG_const_type)
    <efa>   DW_AT_type        : <0xe86>
 <1><efe>: Abbrev Number: 32 (DW_TAG_structure_type)
    <eff>   DW_AT_name        : (indirect string, offset: 0x40f4f): _reent
    <f03>   DW_AT_byte_size   : 96
    <f04>   DW_AT_decl_file   : 17
    <f05>   DW_AT_decl_line   : 377
    <f07>   DW_AT_decl_column : 8
    <f08>   DW_AT_sibling     : <0x1041>
 <2><f0c>: Abbrev Number: 13 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x4fb42): _errno
    <f11>   DW_AT_decl_file   : 17
    <f12>   DW_AT_decl_line   : 381
    <f14>   DW_AT_decl_column : 7
    <f15>   DW_AT_type        : <0x91>
    <f19>   DW_AT_data_member_location: 0
 <2><f1a>: Abbrev Number: 13 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x41499): _stdin
    <f1f>   DW_AT_decl_file   : 17
    <f20>   DW_AT_decl_line   : 386
    <f22>   DW_AT_decl_column : 11
    <f23>   DW_AT_type        : <0x1299>
    <f27>   DW_AT_data_member_location: 4
 <2><f28>: Abbrev Number: 13 (DW_TAG_member)
    <f29>   DW_AT_name        : (indirect string, offset: 0x186f5): _stdout
    <f2d>   DW_AT_decl_file   : 17
    <f2e>   DW_AT_decl_line   : 386
    <f30>   DW_AT_decl_column : 20
    <f31>   DW_AT_type        : <0x1299>
    <f35>   DW_AT_data_member_location: 8
 <2><f36>: Abbrev Number: 13 (DW_TAG_member)
    <f37>   DW_AT_name        : (indirect string, offset: 0x3a7ba): _stderr
    <f3b>   DW_AT_decl_file   : 17
    <f3c>   DW_AT_decl_line   : 386
    <f3e>   DW_AT_decl_column : 30
    <f3f>   DW_AT_type        : <0x1299>
    <f43>   DW_AT_data_member_location: 12
 <2><f44>: Abbrev Number: 13 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x56085): _inc
    <f49>   DW_AT_decl_file   : 17
    <f4a>   DW_AT_decl_line   : 388
    <f4c>   DW_AT_decl_column : 8
    <f4d>   DW_AT_type        : <0x91>
    <f51>   DW_AT_data_member_location: 16
 <2><f52>: Abbrev Number: 13 (DW_TAG_member)
    <f53>   DW_AT_name        : (indirect string, offset: 0x6b4a6): _emergency
    <f57>   DW_AT_decl_file   : 17
    <f58>   DW_AT_decl_line   : 390
    <f5a>   DW_AT_decl_column : 9
    <f5b>   DW_AT_type        : <0x11ad>
    <f5f>   DW_AT_data_member_location: 20
 <2><f60>: Abbrev Number: 13 (DW_TAG_member)
    <f61>   DW_AT_name        : (indirect string, offset: 0x3bb2e): __sdidinit
    <f65>   DW_AT_decl_file   : 17
    <f66>   DW_AT_decl_line   : 392
    <f68>   DW_AT_decl_column : 7
    <f69>   DW_AT_type        : <0x91>
    <f6d>   DW_AT_data_member_location: 24
 <2><f6e>: Abbrev Number: 13 (DW_TAG_member)
    <f6f>   DW_AT_name        : (indirect string, offset: 0xc942): _unspecified_locale_info
    <f73>   DW_AT_decl_file   : 17
    <f74>   DW_AT_decl_line   : 394
    <f76>   DW_AT_decl_column : 7
    <f77>   DW_AT_type        : <0x91>
    <f7b>   DW_AT_data_member_location: 28
 <2><f7c>: Abbrev Number: 13 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x78227): _locale
    <f81>   DW_AT_decl_file   : 17
    <f82>   DW_AT_decl_line   : 395
    <f84>   DW_AT_decl_column : 22
    <f85>   DW_AT_type        : <0x1401>
    <f89>   DW_AT_data_member_location: 32
 <2><f8a>: Abbrev Number: 12 (DW_TAG_member)
    <f8b>   DW_AT_name        : _mp
    <f8f>   DW_AT_decl_file   : 17
    <f90>   DW_AT_decl_line   : 397
    <f92>   DW_AT_decl_column : 18
    <f93>   DW_AT_type        : <0x1407>
    <f97>   DW_AT_data_member_location: 36
 <2><f98>: Abbrev Number: 13 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x151a3): __cleanup
    <f9d>   DW_AT_decl_file   : 17
    <f9e>   DW_AT_decl_line   : 399
    <fa0>   DW_AT_decl_column : 10
    <fa1>   DW_AT_type        : <0x1418>
    <fa5>   DW_AT_data_member_location: 40
 <2><fa6>: Abbrev Number: 13 (DW_TAG_member)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x22006): _gamma_signgam
    <fab>   DW_AT_decl_file   : 17
    <fac>   DW_AT_decl_line   : 401
    <fae>   DW_AT_decl_column : 7
    <faf>   DW_AT_type        : <0x91>
    <fb3>   DW_AT_data_member_location: 44
 <2><fb4>: Abbrev Number: 13 (DW_TAG_member)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x640ff): _cvtlen
    <fb9>   DW_AT_decl_file   : 17
    <fba>   DW_AT_decl_line   : 404
    <fbc>   DW_AT_decl_column : 7
    <fbd>   DW_AT_type        : <0x91>
    <fc1>   DW_AT_data_member_location: 48
 <2><fc2>: Abbrev Number: 13 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x3f6c1): _cvtbuf
    <fc7>   DW_AT_decl_file   : 17
    <fc8>   DW_AT_decl_line   : 405
    <fca>   DW_AT_decl_column : 9
    <fcb>   DW_AT_type        : <0x11ad>
    <fcf>   DW_AT_data_member_location: 52
 <2><fd0>: Abbrev Number: 13 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0x65c66): _r48
    <fd5>   DW_AT_decl_file   : 17
    <fd6>   DW_AT_decl_line   : 407
    <fd8>   DW_AT_decl_column : 19
    <fd9>   DW_AT_type        : <0x141e>
    <fdd>   DW_AT_data_member_location: 56
 <2><fde>: Abbrev Number: 13 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x711d3): _localtime_buf
    <fe3>   DW_AT_decl_file   : 17
    <fe4>   DW_AT_decl_line   : 408
    <fe6>   DW_AT_decl_column : 16
    <fe7>   DW_AT_type        : <0x1424>
    <feb>   DW_AT_data_member_location: 60
 <2><fec>: Abbrev Number: 13 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x200c3): _asctime_buf
    <ff1>   DW_AT_decl_file   : 17
    <ff2>   DW_AT_decl_line   : 409
    <ff4>   DW_AT_decl_column : 9
    <ff5>   DW_AT_type        : <0x11ad>
    <ff9>   DW_AT_data_member_location: 64
 <2><ffa>: Abbrev Number: 13 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x6fb07): _sig_func
    <fff>   DW_AT_decl_file   : 17
    <1000>   DW_AT_decl_line   : 412
    <1002>   DW_AT_decl_column : 12
    <1003>   DW_AT_type        : <0x1435>
    <1007>   DW_AT_data_member_location: 68
 <2><1008>: Abbrev Number: 13 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x618d6): __sglue
    <100d>   DW_AT_decl_file   : 17
    <100e>   DW_AT_decl_line   : 420
    <1010>   DW_AT_decl_column : 16
    <1011>   DW_AT_type        : <0x125a>
    <1015>   DW_AT_data_member_location: 72
 <2><1016>: Abbrev Number: 13 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0x24d84): __sf
    <101b>   DW_AT_decl_file   : 17
    <101c>   DW_AT_decl_line   : 421
    <101e>   DW_AT_decl_column : 11
    <101f>   DW_AT_type        : <0x1299>
    <1023>   DW_AT_data_member_location: 84
 <2><1024>: Abbrev Number: 13 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0x3e0df): _misc
    <1029>   DW_AT_decl_file   : 17
    <102a>   DW_AT_decl_line   : 422
    <102c>   DW_AT_decl_column : 23
    <102d>   DW_AT_type        : <0x1441>
    <1031>   DW_AT_data_member_location: 88
 <2><1032>: Abbrev Number: 13 (DW_TAG_member)
    <1033>   DW_AT_name        : (indirect string, offset: 0x54d45): _signal_buf
    <1037>   DW_AT_decl_file   : 17
    <1038>   DW_AT_decl_line   : 423
    <103a>   DW_AT_decl_column : 9
    <103b>   DW_AT_type        : <0x11ad>
    <103f>   DW_AT_data_member_location: 92
 <2><1040>: Abbrev Number: 0
 <1><1041>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <1042>   DW_AT_byte_size   : 4
    <1043>   DW_AT_type        : <0xefe>
 <1><1047>: Abbrev Number: 5 (DW_TAG_const_type)
    <1048>   DW_AT_type        : <0x1041>
 <1><104c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <104d>   DW_AT_name        : (indirect string, offset: 0x685ae): __sFILE
    <1051>   DW_AT_byte_size   : 104
    <1052>   DW_AT_decl_file   : 17
    <1053>   DW_AT_decl_line   : 186
    <1054>   DW_AT_decl_column : 8
    <1055>   DW_AT_sibling     : <0x118f>
 <2><1059>: Abbrev Number: 29 (DW_TAG_member)
    <105a>   DW_AT_name        : _p
    <105d>   DW_AT_decl_file   : 17
    <105e>   DW_AT_decl_line   : 187
    <105f>   DW_AT_decl_column : 18
    <1060>   DW_AT_type        : <0xe80>
    <1064>   DW_AT_data_member_location: 0
 <2><1065>: Abbrev Number: 29 (DW_TAG_member)
    <1066>   DW_AT_name        : _r
    <1069>   DW_AT_decl_file   : 17
    <106a>   DW_AT_decl_line   : 188
    <106b>   DW_AT_decl_column : 7
    <106c>   DW_AT_type        : <0x91>
    <1070>   DW_AT_data_member_location: 4
 <2><1071>: Abbrev Number: 29 (DW_TAG_member)
    <1072>   DW_AT_name        : _w
    <1075>   DW_AT_decl_file   : 17
    <1076>   DW_AT_decl_line   : 189
    <1077>   DW_AT_decl_column : 7
    <1078>   DW_AT_type        : <0x91>
    <107c>   DW_AT_data_member_location: 8
 <2><107d>: Abbrev Number: 18 (DW_TAG_member)
    <107e>   DW_AT_name        : (indirect string, offset: 0x3eaf2): _flags
    <1082>   DW_AT_decl_file   : 17
    <1083>   DW_AT_decl_line   : 190
    <1084>   DW_AT_decl_column : 9
    <1085>   DW_AT_type        : <0x43>
    <1089>   DW_AT_data_member_location: 12
 <2><108a>: Abbrev Number: 18 (DW_TAG_member)
    <108b>   DW_AT_name        : (indirect string, offset: 0x14ae6): _file
    <108f>   DW_AT_decl_file   : 17
    <1090>   DW_AT_decl_line   : 191
    <1091>   DW_AT_decl_column : 9
    <1092>   DW_AT_type        : <0x43>
    <1096>   DW_AT_data_member_location: 14
 <2><1097>: Abbrev Number: 29 (DW_TAG_member)
    <1098>   DW_AT_name        : _bf
    <109c>   DW_AT_decl_file   : 17
    <109d>   DW_AT_decl_line   : 192
    <109e>   DW_AT_decl_column : 17
    <109f>   DW_AT_type        : <0xe58>
    <10a3>   DW_AT_data_member_location: 16
 <2><10a4>: Abbrev Number: 18 (DW_TAG_member)
    <10a5>   DW_AT_name        : (indirect string, offset: 0x3ef75): _lbfsize
    <10a9>   DW_AT_decl_file   : 17
    <10aa>   DW_AT_decl_line   : 193
    <10ab>   DW_AT_decl_column : 7
    <10ac>   DW_AT_type        : <0x91>
    <10b0>   DW_AT_data_member_location: 24
 <2><10b1>: Abbrev Number: 18 (DW_TAG_member)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x8a27b): _data
    <10b6>   DW_AT_decl_file   : 17
    <10b7>   DW_AT_decl_line   : 196
    <10b8>   DW_AT_decl_column : 18
    <10b9>   DW_AT_type        : <0x1041>
    <10bd>   DW_AT_data_member_location: 28
 <2><10be>: Abbrev Number: 18 (DW_TAG_member)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x78bec): _cookie
    <10c3>   DW_AT_decl_file   : 17
    <10c4>   DW_AT_decl_line   : 200
    <10c5>   DW_AT_decl_column : 10
    <10c6>   DW_AT_type        : <0x6dd>
    <10ca>   DW_AT_data_member_location: 32
 <2><10cb>: Abbrev Number: 18 (DW_TAG_member)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x6b3d6): _read
    <10d0>   DW_AT_decl_file   : 17
    <10d1>   DW_AT_decl_line   : 202
    <10d2>   DW_AT_decl_column : 29
    <10d3>   DW_AT_type        : <0x11bf>
    <10d7>   DW_AT_data_member_location: 36
 <2><10d8>: Abbrev Number: 18 (DW_TAG_member)
    <10d9>   DW_AT_name        : (indirect string, offset: 0x11209): _write
    <10dd>   DW_AT_decl_file   : 17
    <10de>   DW_AT_decl_line   : 204
    <10df>   DW_AT_decl_column : 29
    <10e0>   DW_AT_type        : <0x11e9>
    <10e4>   DW_AT_data_member_location: 40
 <2><10e5>: Abbrev Number: 18 (DW_TAG_member)
    <10e6>   DW_AT_name        : (indirect string, offset: 0x84711): _seek
    <10ea>   DW_AT_decl_file   : 17
    <10eb>   DW_AT_decl_line   : 207
    <10ec>   DW_AT_decl_column : 13
    <10ed>   DW_AT_type        : <0x120d>
    <10f1>   DW_AT_data_member_location: 44
 <2><10f2>: Abbrev Number: 18 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x3c615): _close
    <10f7>   DW_AT_decl_file   : 17
    <10f8>   DW_AT_decl_line   : 208
    <10f9>   DW_AT_decl_column : 9
    <10fa>   DW_AT_type        : <0x1227>
    <10fe>   DW_AT_data_member_location: 48
 <2><10ff>: Abbrev Number: 29 (DW_TAG_member)
